[{"author":"Reuters","description":"Puerto Rico will face investors for the first time in a bankruptcy court, as it begins the most divisive debt restructuring in U.S. history.","publishedAt":0,"title":"Puerto Rico Faces Off With Creditors for the First Time in Bankruptcy Court Wednesday","url":"http://fortune.com/2017/05/17/puerto-rico-creditors-bankruptcy-court/","urlToImage":"https://fortunedotcom.files.wordpress.com/2016/08/494295570.jpg?w=720","score":30.281387,"fetchedAt":0},{"author":"Nick Brown and Daniel Bases","description":"Puerto Rico's main creditors, meeting before a U.S. bankruptcy judge in the largest public finance restructuring case in history, are interested in continuing mediation settlement talks to resolve the island's unpayable $70 billion debt bill.","publishedAt":0,"title":"Puerto Rico creditors open to mediation in bankruptcy court","url":"http://www.reuters.com/article/us-puertorico-debt-hearing-idUSKCN18D0D9","urlToImage":"http://s3.reutersmedia.net/resources/r/?m=02&d=20170517&t=2&i=1185112864&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPED4G1EN","score":28.973488,"fetchedAt":0},{"author":"CARLOS RIVERA GIUSTI and DAVID McFADDEN","description":"SAN JUAN, Puerto Rico (AP) — Puerto Rico nationalist Oscar Lopez Rivera was freed from house arrest Wednesday after decades in custody in a case that transformed him into a martyr for his supporters but had outraged those who lost loved ones in a string of bombings. Wearing black jeans and a shirt decorated with a Puerto Rican flag pin, the 74-year-old greeted cheering supporters through a fence at his daughter's San Juan home before getting into a jeep. Roughly 50 people held flowers, some embracing in tears and chanting: \"Free at last!\" A group of singers from University of Puerto Rico's choir harmonized as Lopez drove by.","publishedAt":0,"title":"Puerto Rico militant freed from custody after 36 years","url":"https://apnews.com/b1747c12989d49b0b50fa9632184052e","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:f92b5594ec524ade84acbde98f25da1a/2952.jpeg","score":28.958698,"fetchedAt":0},{"author":"Daniel Bases","description":"Puerto Rico is due to embark on a bankruptcy process on Wednesday that could take years to resolve, as investors scramble to get the highest recovery on their bonds.","publishedAt":0,"title":"Puerto Rico's bankruptcy hearing marks reset of asset scramble","url":"http://www.reuters.com/article/us-puertorico-debt-prices-analysis-idUSKCN18C2KI","urlToImage":"http://s4.reutersmedia.net/resources/r/?m=02&d=20170516&t=2&i=1185003396&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPED4F1JX","score":28.630743,"fetchedAt":0},{"author":"Steven Church","description":"Puerto Rico’s $123 billion bankruptcy kicked off with the judge and creditor lawyers agreeing that a split between holders of general obligation and sales-tax bonds will dominate the case.","publishedAt":0,"title":"Puerto Rico Debt Case Starts With Squabble Between Bondholders","url":"https://www.bloomberg.com/news/articles/2017-05-17/puerto-rico-debt-case-starts-with-squabble-between-bondholders","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iz_by6W_f0zs/v0/1200x800.jpg","score":26.664299,"fetchedAt":0}]