[{"author":"Football Italia Staff","description":"Ivanka Trump, visiting Rome with father and US President Donald Trump, mistook Lazio striker Giorgio Chinaglia for a Saint.","publishedAt":0,"title":"Ivanka Trump on &#039;Saint&#039; Chinaglia","url":"http://www.football-italia.net/103076/ivanka-trump-saint-chinaglia","urlToImage":"http://www.football-italia.net/sites/default/files/imagecache/main_photo/[type]/[nid]/Chinaglia-Ivanka-Trump-huffpost.jpg","score":20.3055,"fetchedAt":0},{"author":"","description":"VATICAN CITY (AP) — The Latest on President Donald Trump's first trip abroad (all times local): 10:40 a.m. Ivanka Trump plans to meet with human trafficking victims in Rome. Trump will meet Wednesday with African women who have been freed in Italy from human traffickers. The encounter was arranged by the Rome-based Catholic charity Sant'Egidio Community, which has ties with the Vatican and which has helped Syrian refugees arrive safely in Italy via \"humanitarian corridors\" The president's daughter and adviser has held meetings at the White House on human trafficking. Community officials said several women will chat with Trump. Trump was expected to make a brief statement to the media after the closed-door meeting at the Community's headquarters. Ivanka Trump was part of the delegation that met Pope Francis with President Donald Trump Wednesday. --- 10:30 a.m. Pope Francis shared a light moment with First Lady Melania Trump. After Francis met with President Donald Trump he was introduced to members of Trump's delegation, including Melania. Smiling for the staff, Francis asked via translator, \"What do you give him to eat, pizza?\" Melanie giggled and said \"Pizza? Yes.\" When it comes to food, the president is known for his traditional American palette. When he traveled in Saudi Arabia, caterers ensured that his favorite meal - steak with a side of ketchup - would be offered alongside the traditional local cuisine. --- 9:50 a.m. President Donald Trump has gifted Pope Francis a first-edition set of writings from Martin Luther King Jr. Trump presented Francis with the books after a private meeting at the Vatican Wednesday. The White House notes that Francis spoke about King and his civil rights legacy during his address to Congress in 2015. The White House said the set includes the five books King wrote in his lifetime. Each one is custom bound and the books are in a custom display case. A piece of granite from the Martin Luther King. Jr. Memorial in Washington is also included. The White House says the gift \"honors Dr. King's hope, vision, and inspiration for generations to come.\" Trump also gave Francis a bronze sculpture. Named \"Rising Above,\" the White House says it \"represents hope for a peaceful tomorrow.\" --- 9:45 p.m. President Donald Trump appeared moved by his private meeting with Pope Francis, telling the pope that he \"won't forget what you said.\" The president and pope have a contentious history and disagree on a host of issues, including environmental protection. The White House did not immediately provide details about what was discussed during their 30-minute private conversation. But the two men appeared on good terms Wednesday, including during a traditional gift exchange. The pope's gifts to Trump included a medal by a Roman artist depicting an olive branch, which is a symbol of peace. The president responded, \"We can use peace.\" The pope also gave the president a signed message of peace along with copies of his three main teaching documents. The president told the pope he'd be reading them.","publishedAt":0,"title":"The Latest: Ivanka Trump to meet human trafficking victims","url":"https://apnews.com/675ed0d9c9914611b6f7e479ac5b8adb","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:76869cab143f4663a150e0787b5f8126/3000.jpeg","score":12.679886,"fetchedAt":0},{"author":"Kate Bennett, CNN's COVER/LINE","description":"In Jerusalem earlier Tuesday, President Donald Trump and first lady Melania Trump, as well as (perpetual shadows) Jared Kushner and Ivanka Trump, were on hand at a wreath-laying ceremony at the Yad Vashem Holocaust Memorial Museum.","publishedAt":0,"title":"The way President Trump signs guest books is different","url":"http://www.cnn.com/2017/05/23/politics/trump-signs-guest-books/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170523125935-trump-signs-guest-book-at-yad-vashem-holocaust-memorial-museum-super-tease.jpg","score":9.196305,"fetchedAt":0},{"author":"Tim Rahmann","description":"Der von US-Präsidententochter Ivanka Trump angekündigte Fonds zur Förderung von Unternehmerinnen in aller Welt muss ohne die Unterstützung der „First Daughter“ auskommen.","publishedAt":0,"title":"Weltbank: Fonds für Frauen: Mit Merkel, ohne Ivanka","url":"http://www.wiwo.de/politik/deutschland/weltbank-fonds-fuer-frauen-mit-merkel-ohne-ivanka/19847964.html","urlToImage":"http://www.wiwo.de/images/ivanka-trump-daughter-and-adviser-of-u-s-president-donald-trump-and-german-chacellor-angela-merkel-attend-a-dinner-in-berlin/19848028/2-format2101.jpg","score":7.807699,"fetchedAt":0}]