[{"author":"The Associated Press","description":"Philippine President Rodrigo Duterte declared the country's south under martial rule for 60 days.","publishedAt":0,"title":"Duterte declares martial rule in south Philippines amid deadly clashes","url":"http://www.washingtonexaminer.com/duterte-declares-martial-rule-in-south-philippines-amid-deadly-clashes/article/2623983","urlToImage":"http://cdn.washingtonexaminer.biz/cache/1060x600-52d49aec36f2e5f40a5321617824be5e.jpg","score":12.5674515,"fetchedAt":0},{"author":"Nyshka Chandran","description":"Philippine President Rodrigo Duterte's hint of nationwide martial law has triggered fears of further human rights violations.","publishedAt":0,"title":"Philippines: Duterte's talk of martial law sparks fresh human rights worries","url":"http://www.cnbc.com/2017/05/24/philippines-dutertes-talk-of-martial-law-sparks-fresh-human-rights-worries.html","urlToImage":"http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/24/104490884-GettyImages-687670766.1910x1000.jpg","score":12.5674515,"fetchedAt":0},{"author":"","description":"Gunfire rings out as army tanks roll into the southern Philippine city of Marawi to repel Islamist insurgents.","publishedAt":0,"title":"Philippines troops enter Marawi as insurgents take hostages, raise IS flag","url":"http://www.abc.net.au/news/2017-05-25/philippines-marawi-isis-duterte-putin/8559082","urlToImage":"http://www.abc.net.au/news/image/8559140-1x1-700x700.jpg","score":12.5674515,"fetchedAt":0},{"author":"JIM GOMEZ and TERESA CEROJANO","description":"MANILA, Philippines (AP) — Philippine President Rodrigo Duterte warned Wednesday that he'll be harsh in enforcing martial law in his country's south as he abruptly left Moscow to deal with a crisis at home sparked by a Muslim extremist siege on a city, where militants burned buildings overnight and are feared to have taken hostages. Duterte declared martial rule for 60 days in the entire southern Mindanao region, the restive third of the Philippine archipelago, Tuesday evening to try to crush Muslim extremists who have aligned themselves with the Islamic State group and occupied a hospital, jail and other buildings and battled troops in an audacious attack in Marawi City.","publishedAt":0,"title":"Duterte declares martial rule in besieged south Philippines","url":"https://apnews.com/a2d52f83b0a84117833f3f51729e7b96","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:d77f666f41d6469ab01ae093e07c9d75/3000.jpeg","score":12.462225,"fetchedAt":0},{"author":"","description":"MARAWI, Philippines (AP) — The Latest on the siege of a southern Philippine city by militants linked to the Islamic State group (all times local): 1 p.m. A top Philippine official says foreign fighters are among the militants linked to the Islamic State group who have laid siege to the southern city of Marawi. Manila Solicitor General Jose Calida told reporters Friday that Indonesians and Malaysians are fighting in Marawi. The militants have torn through the streets of Marawi since Tuesday night, torching buildings, taking a priest and his worshippers hostage and sealing off much of the city. At least 44 people have died in the fighting, including 31 militants and 11 soldiers. A number of foreign militants have had a presence in the southern Philippines for decades, including some of Asia's most-wanted.","publishedAt":0,"title":"The Latest: Foreign fighters among militants in Philippines","url":"https://apnews.com/7105b4c71fb74f9ab6463e61a48faad6","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:a1c328d060324d939626cc3a42fba2ab/3000.jpeg","score":12.454199,"fetchedAt":0},{"author":"Chris Tomson","description":"DAMASCUS, SYRIA (8:30 P.M.) – Overnight, heavy clashes erupted in the predominately Sunni city of Marawi in the southern Philippines after security forces","publishedAt":0,"title":"In pictures: ISIS takes control of its first city in the Philippines","url":"https://mobile.almasdarnews.com/article/pictures-isis-takes-control-first-city-philippines/","urlToImage":"https://mobile.almasdarnews.com/wp-content/uploads/2017/05/DAgzdWMWAAAs0LG.jpg","score":11.870303,"fetchedAt":0},{"author":"Frances Martel","description":"Government officials in the Philippines have confirmed that some terrorists fighting with Islamic State affiliates are foreigners.","publishedAt":0,"title":"'Invasion': Officials Confirm Foreigners Fighting for Islamic State in 90% Christian Philippines - Breitbart","url":"http://www.breitbart.com/national-security/2017/05/26/jihadist-invasion-philippines-confirms-foreigners-fighting-for-islamic-state-in-the-south/","urlToImage":"http://media.breitbart.com/media/2016/08/abu-sayyaf-rebels-screenshot-reuters.jpg","score":11.381659,"fetchedAt":0},{"author":"JIM GOMEZ and TERESA CEROJANO","description":"ILIGAN, Philippines (AP) — One of Asia's most-wanted militants is still hiding out in a city in the southern Philippines where government forces backed by armored vehicles and helicopters are battling gunmen linked to the Islamic State group, the country's military chief said Friday. The city of Marawi, home to some 200,000 people, has been under siege by militants since a government raid Tuesday night on a suspected hideout of Isnilon Hapilon, who is on Washington's list of most-wanted terrorists. \"Right now, he is still inside (the city),\" Gen. Eduardo Ano told The Associated Press. \"We cannot just pinpoint the particular spot.\"","publishedAt":0,"title":"Philippines official: Terror suspect still in besieged city","url":"https://apnews.com/ff6a0e39827846b88731c2fe2001bbe9","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:ffdf78a19a8f4f6ea4f78af0b71aeaa6/3000.jpeg","score":11.155529,"fetchedAt":0},{"author":"","description":"Islamic State group-linked militants swept through a southern Philippine city, beheading a police chief, burning buildings, seizing a Catholic priest and his worshippers and raising the black flag of IS, authorities said Wednesday.","publishedAt":0,"title":"ISIS-linked militants attack Philippine city, behead police chief","url":"https://www.usatoday.com/story/news/world/2017/05/24/priest-among-14-hostages-taken-siege-philippines-city-duterte-martial-law/102093760/","urlToImage":"https://www.gannett-cdn.com/-mm-/1c34dcee06a9df1aa3ed25a2c53187334a78be19/c=0-45-240-180&r=x633&c=1200x630/local/-/media/2017/05/24/USATODAY/USATODAY/636312100435073627-EPA-PHILIPPINES-MARTIAL-LAW-91154408.JPG","score":11.039459,"fetchedAt":0},{"author":"Romeo Ranoco","description":"Troops backed by attack helicopters battled dozens of militants linked to the Islamic State group holed up in a besieged city in the southern Philippines on Thursday after attempts to secure volatile areas met heavy resistance.","publishedAt":0,"title":"Philippines deploys helicopters in battle to retake city from Islamist rebels","url":"http://www.reuters.com/article/us-philippines-militants-idUSKBN18L0CS","urlToImage":"//s4.reutersmedia.net/resources/r/?m=02&d=20170525&t=2&i=1186194483&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPED4O08Y","score":11.039459,"fetchedAt":0}]