[{"author":"Michelle Mark","description":"\"This is not fair to the people and taxpayers of the United States, and many of these nations owe massive amounts of money from past years,\" Trump said.","publishedAt":0,"title":"Trump lectures NATO allies to their faces as they look on in awkward silence","url":"http://www.businessinsider.com/trump-nato-speech-defense-spending-2017-5","urlToImage":"http://static4.businessinsider.com/image/5926f943621e6c3e008b4b56-1190-625/trump-lectures-nato-allies-to-their-faces-as-they-look-on-in-awkward-silence.jpg","score":8.543589,"fetchedAt":0},{"author":"Nahal Toosi","description":"Trump policies are having a 'chilling effect' on travel to the United States from Muslim nations, an immigration lawyer says.","publishedAt":0,"title":"Visas to Muslim-majority countries down 20 percent","url":"http://www.politico.com/story/2017/05/25/trump-muslim-visas-238846","urlToImage":"http://static.politico.com/f0/c8/75a167e549f296bbc5d4110e7133/14-donald-trump-11-ap-1160.jpg","score":8.543589,"fetchedAt":0},{"author":"By Jason Groves In Sicily For The Daily Mail","description":"The Prime Minister will urge the world's major industrialised nations to unite to force technology companies to tackle 'extremist material'.","publishedAt":0,"title":"Theresa May asks G7 to back moves to tackle web extremism","url":"http://www.dailymail.co.uk/news/article-4543080/Britains-May-asks-G7-moves-tackle-internet-extremism.html","urlToImage":"http://i.dailymail.co.uk/i/pix/2017/05/25/23/40CCDEC500000578-0-image-a-61_1495751247672.jpg","score":8.543589,"fetchedAt":0},{"author":"Jacob Wirtschafter","description":"A recent United Nations survey finds 99.3% of Egyptian women are sexually harassed in their lifetimes.","publishedAt":0,"title":"Who's fed up with sex assaults on Egyptian women? These guys","url":"https://www.usatoday.com/story/news/world/2017/05/26/egyptian-men-combat-sexual-harassment/101717652/","urlToImage":"https://www.gannett-cdn.com/-mm-/bf45918d7dbf945db35b22b51d7223b897aa74ad/c=16-0-2208-1238&r=x633&c=1200x630/local/-/media/2017/05/15/USATODAY/USATODAY/636304572035393027-EGY17125ss1.jpg","score":8.543589,"fetchedAt":0},{"author":"JULIE PACE and JONATHAN LEMIRE","description":"BRUSSELS (AP) — Surrounded by stone-faced allies, President Donald Trump rebuked fellow NATO members Thursday for failing to meet the military alliance's financial benchmarks, asserting that leaves it weaker and shortchanges \"the people and taxpayers of the United States.\" Trump, who has often complained back home about other nations' NATO support, lectured the other leaders in person this time, declaring, \"Many of these nations owe massive amounts of money from past years.\"","publishedAt":0,"title":"Trump scolds fellow NATO leaders: Spend more for military","url":"https://apnews.com/2ed02c1ee7c64061a2bf146bfb0a4b2c","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:68c3e6cc069a46b387bf916a87bfa723/3000.jpeg","score":5.279211,"fetchedAt":0},{"author":"BY SETH BORENSTEIN","description":"WASHINGTON (AP) — Earth is likely to reach more dangerous levels of warming even sooner if the U.S. retreats from its pledge to cut carbon dioxide pollution, scientists said. That's because America contributes so much to rising temperatures. President Donald Trump, who once proclaimed global warming a Chinese hoax, said in a tweet Saturday that he would make his \"final decision\" next week on whether the United States stays in or leaves the 2015 Paris climate change accord in which nearly every nation agreed to curb its greenhouse gas emissions.","publishedAt":0,"title":"What if US quits climate deal? Doesn't look good for Earth","url":"https://apnews.com/a96d26f80df141ecb7d4851bb3ae6f48","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:22aa13f7812c4eeaacc9c772e3ebd8c1/3000.jpeg","score":3.3059368,"fetchedAt":0},{"author":"CASSANDRA VINOGRAD","description":"BRIA, Central African Republic (AP) — Scores of blackened homes dot this town where more than 41,000 people have fled for their lives. Deadly sectarian violence that has gripped Central African Republic since 2013 is surging again, even spreading to parts of the country that once had been spared. The number of people displaced could reach half a million by month's end, the United Nations says, a level not seen in more than three years. Some people have had little time to escape. \"I have nothing. No sheets, no covers. I have nothing,\" says 50-year-old Marie Edith Mambleka.","publishedAt":0,"title":"Central African Republic killings send entire town fleeing","url":"https://apnews.com/7e66a08065fd41339a2f8b83446f666c","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:033e4e8544b345a486cdd19f9e145b0e/3000.jpeg","score":3.3059368,"fetchedAt":0}]