[{"author":"MUHANAD AL-SALEH and QASSIM ABDUL-ZAHRA","description":"BAGHDAD (AP) — Iraq's Sunni minority is pushing for a greater say in power once the Islamic State group is defeated, reflecting growing sentiment that the country's government must be more inclusive to prevent extremism from gaining ground once again. But so far, there's little momentum. Many Shiite politicians are wary, and the Sunni leadership is divided and disorganized. On the ground, tensions are further stoked because Shiite militias and Kurdish fighters control some mainly Sunni areas recaptured from IS militants and are resistant to withdrawing.","publishedAt":0,"title":"Sunnis seek greater say in post-IS Iraq but face resistance","url":"https://apnews.com/25a575048ec24d649484f5273fbb06c0","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:b18e0aa3cdb54d79bb25ba4483d273e8/3000.jpeg","score":10.656265,"fetchedAt":0},{"author":"Martin Chulov","description":"Airstrikes mark first clash between US and Tehran-backed forces since US military returned to region, as battle lines shift in Syria and Iraq","publishedAt":0,"title":"US jets attack Iran-backed militiamen in south-eastern Syria","url":"https://www.theguardian.com/world/2017/may/18/us-iran-jet-attack-syria","urlToImage":"https://i.guim.co.uk/img/media/365eadcea4eadbc50bbf8852fde25aad8567d019/0_384_5760_3456/master/5760.jpg?w=1200&h=630&q=55&auto=format&usm=12&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&s=1113320107946a174df52c48080807b9","score":6.8975906,"fetchedAt":0},{"author":"ROBERT BURNS","description":"WASHINGTON (AP) — The United States is looking ahead toward a decisive battleground in its bid to destroy the Islamic State group, even as U.S.-backed local forces must still finish the fight for the extremists' two main strongholds in Iraq and Syria. The roughly 100-mile stretch of IS-controlled territory straddling the Iraq-Syria border could represent the start of an endgame for defeating an extremist group that had gobbled up large swaths of territory in the heart of the Middle East, at one point even threatening Baghdad.","publishedAt":0,"title":"Amid Raqqa, Mosul fights, US prepares for IS endgame effort","url":"https://apnews.com/47f1309c2b614cc5863cb70399d09ea1","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:afbe8e6fbfc246aaa568db4077e4910f/3000.jpeg","score":5.8990936,"fetchedAt":0},{"author":"Nafeesa Syeed","description":"President Donald Trump has ordered the U.S. to ramp up its campaign against Islamic State with an “annihilation” campaign to surround and kill terrorists rather than chasing them out of territory in Iraq and Syria, his defense chief said.","publishedAt":0,"title":"Trump Ordered Changes to 'Annihilate' Islamic State, Mattis Says","url":"https://www.bloomberg.com/politics/articles/2017-05-19/trump-ordered-changes-to-annihilate-islamic-state-mattis-says","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/io7.nRY2n_6c/v0/1200x719.jpg","score":4.8486133,"fetchedAt":0},{"author":"JON GAMBRELL","description":"DUBAI, United Arab Emirates (AP) — Iranians vote Friday for the next president of the Islamic Republic, but how does that elected leader fit into the country's clerically managed government that approves candidates ultimately overseen by its supreme leader? THE SUPREME LEADER'S POWER At the heart of Iran's complex power-sharing government created after its 1979 Islamic Revolution is the supreme leader, a position now held by Ayatollah Ali Khamenei. The supreme leader also serves as the country's commander in chief over its military and the powerful Revolutionary Guard, a paramilitary force involved in the war in Syria and the battle against the Islamic State group militants in Iraq that also has vast economic holdings across Iran. An 88-member elected clerical panel called the Assembly of Experts appoints the supreme leader and can remove one as well, though that's never happened.","publishedAt":0,"title":"AP Explains: Voting, governance and clerical power in Iran","url":"https://apnews.com/539986cd08df4a88bdb21417c31df66f","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:ce643d38d1b44eec962dc10722fd0980/3000.jpeg","score":2.3330753,"fetchedAt":0},{"author":"","description":"KANSAS CITY, Mo. (AP) — The Latest on the release of Pvt. Chelsea Manning from a Kansas military prison (all times local): 7:50 a.m. The U.S. Army says Pvt. Chelsea Manning has been released from a Kansas military prison after serving seven years of her 35-year sentence for leaking classified government materials to WikiLeaks. Army spokeswoman Cynthia Smith says The transgender soldier was released from Fort Leavenworth on Wednesday. Former President Barack Obama granted Manning clemency during his final days in office. Manning, an Oklahoma native, was convicted in 2013 of 20 counts, including six Espionage Act violations, theft and computer fraud. She was acquitted of the most serious charge of aiding the enemy. The former intelligence analyst in Iraq acknowledged leaking the materials, saying she wanted to expose what she considered to be the U.S. military's disregard of the effects of war on civilians. She was known as Bradley Manning before transitioning in prison.","publishedAt":0,"title":"The Latest: Chelsea Manning freed after 7 years in prison","url":"https://apnews.com/026c5eb76a6d4a25b2954887c978976d","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:ca5ff235cf504d618b1dec2000b0d54f/2000.jpeg","score":1.7196871,"fetchedAt":0}]