[{"author":"KAWEEWIT KAEWJINDA","description":"BANGKOK (AP) — A morbidly obese wild monkey who gorged himself on junk food and soda left behind by tourists has been rescued and placed on a strict diet of lean protein, fruits and vegetables. Wildlife officials caught the chunky monkey — nicknamed \"Uncle Fat\" by locals — after photos of the animal started circulating on social media last month. Wild monkeys roam free in many parts of Thailand, attracting tourists who feed and play with the animals. Most of the monkeys are macaques like Uncle Fat, and they typically weigh around 9 kilograms (20 pounds).","publishedAt":0,"title":"Thailand's chunky monkey on diet after gorging on junk food","url":"https://apnews.com/3b505132cd844d8dabf23d7136a42bd4","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:dc4d3a47aba34e0ca4ad46167b686181/3000.jpeg","score":9.987983,"fetchedAt":0},{"author":"http://www.abc.net.au/news/liam-cochrane/5248676","description":"A Thai student arrested for sharing a BBC profile of Thailand's new King on Facebook is awarded a prestigious human rights award.","publishedAt":0,"title":"Thai student activist given human rights award, but kept in jail","url":"http://www.abc.net.au/news/2017-05-18/thai-student-activist-given-human-rights-award,-but-kept-in-jail/8536176","urlToImage":"http://www.abc.net.au/news/image/8150072-1x1-700x700.jpg","score":8.153922,"fetchedAt":0},{"author":"Kaweewit Kaewjinda","description":"A morbidly obese wild monkey who gorged himself on junk food and soda left behind by tourists in Thailand has been rescued and placed on a strict diet of lean protein, fruits and vegetables.  Wildlife officials caught the chunky monkey — nicknamed “Uncle Fat” by locals — after photos of the animal started circulating on social media last month.","publishedAt":0,"title":"Morbidly obese monkey addicted to junk food put on diet","url":"http://www.independent.co.uk/news/world/asia/uncle-fat-obese-macaque-monkey-thailand-diet-junk-food-binge-morbid-a7744156.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/19/09/uncle-fat-obese-monkey.jpg","score":3.8149152,"fetchedAt":0}]