[{"author":"Natasha Bertrand","description":"US Secretary of State Rex Tillerson told reporters Thursday that the crises that have plagued President Donald Trump's first four months in office won't cast...","publishedAt":0,"title":"Trump's secretary of state says the world isn't watching Washington's turmoil — experts say that's 'wishful thinking'","url":"http://www.businessinsider.com/trump-trip-abroad-saudi-arabia-israel-2017-5","urlToImage":"http://static1.businessinsider.com/image/58c9a1c36ff8016b008b5264-1190-625/trumps-secretary-of-state-says-the-world-isnt-watching-washingtons-turmoil--experts-say-thats-wishful-thinking.jpg","score":13.386768,"fetchedAt":0},{"author":"Laura Koran, CNN","description":"The State Department is withholding a document related to Secretary of State Rex Tillerson's communications with the department about Russia in his capacity as ExxonMobil Chairman and CEO, citing a need to protect internal deliberations.","publishedAt":0,"title":"State denies release of Tillerson document","url":"http://www.cnn.com/2017/05/18/politics/tillerson-state-department-communication/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170123175744-02-rex-tillerson-file-super-tease.jpg","score":11.547981,"fetchedAt":0},{"author":"Patricia Hurtado","description":"New York Attorney General Eric Schneiderman is pressing on with a search for U.S. Secretary of State Rex Tillerson’s lost emails that he wrote under the pseudonym of “Wayne Tracker” while he was the Chief Executive of Exxon Mobile Corp.","publishedAt":0,"title":"Schneiderman Presses Search for Tillerson Lost Exxon Emails","url":"https://www.bloomberg.com/news/articles/2017-05-19/schneiderman-presses-search-for-tillerson-s-lost-exxon-emails","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iodVgebJglFc/v0/1200x800.jpg","score":11.547981,"fetchedAt":0},{"author":"","description":"A White House official said Trump and Secretary of State Rex Tillerson would attend the signing of a memorandum of intent on a package of defence equipment and services to bolster the security of the kingdom and the Gulf region in the face of Iranian threats.","publishedAt":0,"title":"Military deals worth $110 billion inked with Saudi Arabia: US official - Times of India","url":"http://timesofindia.indiatimes.com/world/us/military-deals-worth-110-billion-inked-with-saudi-arabia-us-official/articleshow/58765898.cms","urlToImage":"http://timesofindia.indiatimes.com/photo/msid-58765891/58765891.jpg?65992","score":11.547981,"fetchedAt":0},{"author":"","description":"WASHINGTON (AP) — The Latest on investigations into Russian interference in the 2016 election and possible Trump campaign connections with the Russians (all times local): 3:30 p.m. The Washington Post is reporting that a current senior White House adviser is under scrutiny as part of an investigation into possible coordination between the Trump campaign and Russia. The newspaper is citing unidentified people familiar with the investigation. The adviser under scrutiny is not named, but described as someone close to Trump. The Post says the revelation comes as the investigation appears to be entering a more open and active phase, with investigators conducting interviews and using a grand jury to issue subpoenas. Current administration officials who have acknowledged contacts with Russian officials include Trump's son-in-law, Jared Kushner, Attorney General Jeff Sessions and Secretary of State Rex Tillerson.","publishedAt":0,"title":"The Latest: Report: Probe has Trump adviser under scrutiny","url":"https://apnews.com/baa23be41d5e48a7a2488d957fb60a51","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:29c7479689fd43af94f35d2110ba95e9/3000.jpeg","score":4.522928,"fetchedAt":0}]