[{"author":"","description":"BRUSSELS (AP) — The Latest on President Donald Trump's first trip abroad (all times local): 4:48 p.m. President Donald Trump is lecturing members of the NATO alliance to pay their fair share on defense during a ceremony at NATO headquarters. Trump says NATO members must \"finally contribute their fair share\" and meet their obligations. The president has been urging NATO leaders to live up to a 2011 decision to increase spending on defense to 2 percent of GDP by 2024. Trump says 23 of the 28 member nations are not paying what they should and he says it's \"not fair\" to the people of the United States. He says many of these nations owe \"massive\" amounts of money from previous years. The president spoke as the other NATO leaders looked on.","publishedAt":0,"title":"The Latest: Trump lectures NATO members on cost sharing","url":"https://apnews.com/23a35ac5074f4b129ce6896f3c095063","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:dc36bb41a81a461f9c78255545efbd3e/3000.jpeg","score":10.454351,"fetchedAt":0},{"author":"LORNE COOK","description":"BRUSSELS (AP) — It sounds strange to characterize the North Atlantic Treaty Organization as a huge gun club, but the comparison can be useful in understanding the world's biggest military alliance. Like many gun clubs, NATO actually has no weapons of its own. The battleships, war planes, missiles and potential pool of more than 3 million personnel are owned and brought to the range by the 28 member states, mostly at their own cost. The only military equipment NATO has is a fleet of early warning radar planes and, from next year, five surveillance drones.","publishedAt":0,"title":"NATO, the world's biggest military alliance, explained","url":"https://apnews.com/540defb22dd640dbad015767ef60ebb1","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:abe731e2e4054429b4c2695066b3c498/3000.jpeg","score":7.3667746,"fetchedAt":0},{"author":"LORNE COOK","description":"BRUSSELS (AP) — NATO is not only rolling out the red carpet for U.S. President Donald Trump in Brussels Thursday, the military alliance — which Trump once declared obsolete — has been busy repackaging its image and is ready to unveil a new headquarters worth more than 1 billion euros. In recent months, member nations have strained to show they are ramping up defense spending as Trump has demanded, even though they have been doing so for a few years in response to an aggressive Russia. And while they agree with the chief of the alliance's most powerful member that NATO can do more to fight terrorism, they say it can be achieved with more of the same; training and mentoring troops in Afghanistan, and equipping local forces in Iraq so they can better fight the Islamic State group themselves.","publishedAt":0,"title":"NATO rolls out the red carpet, buffs its image for Trump","url":"https://apnews.com/1e412fe9983747a6a8f94a2356d31f96","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:46bfeb4eec4b41a6a85c39e544a46e3c/2160.jpeg","score":7.106103,"fetchedAt":0}]