[{"author":"Darrell Etherington","description":"Uber is now the 'Uber for trucking' – Uber Freight is a new service from the ride hailing company that pairs up trucking companies, including independent..","publishedAt":0,"title":"Uber Freight launches to connect truck drivers with available shipments","url":"https://techcrunch.com/2017/05/18/uber-freight-launches-to-connect-truck-drivers-with-available-shipments/","urlToImage":"https://tctechcrunch2011.files.wordpress.com/2017/05/uber-freight.gif?w=680&h=285&crop=1","score":16.472742,"fetchedAt":0},{"author":"SCOTT SMITH","description":"FRESNO, Calif. (AP) — The bee industry is buzzing over the arrest of a man accused of stealing thousands of hives worth nearly $1 million from California's almond orchards in one of the biggest such thefts on record. The case has thrown a spotlight on a business many city slickers probably never knew existed: Beekeepers in the U.S. move their colonies around the country by truck and rent them out to farmers to pollinate their flowering crops. In California, which relies on bees brought in from such places as Missouri, Montana and North Dakota to produce more almonds than any other place in the world, hives began to vanish overnight across several counties three years ago.","publishedAt":0,"title":"Bee industry buzzing: Stolen hives recovered in California","url":"https://apnews.com/2357ece59e2045babe67fe7202d6e6c8","urlToImage":"","score":3.0898864,"fetchedAt":0},{"author":"KEN RITTER","description":"LAS VEGAS (AP) — A Las Vegas police officer used a stun gun seven times and a mixed martial arts chokehold to subdue an unarmed man who died after a foot chase through a casino over the weekend, authorities said Wednesday. Officer Kenneth Lopera thought the man had tried to carjack a pickup truck with two people inside before the officer fired the stun gun in a series of staccato bursts and used the chokehold — a tactic that is not approved by the department — early Sunday at The Venetian resort, Clark County Undersheriff Kevin McMahill said.","publishedAt":0,"title":"Vegas police: Martial arts chokehold used in deadly chase","url":"https://apnews.com/b4b76c273cfe4509bf34e8708cf20ddb","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:4b3db8b178e442d8b38abb426fe49cfb/3000.jpeg","score":3.0898864,"fetchedAt":0}]