[{"author":"Martin Petty and Karen Lema","description":"Philippine President Rodrigo Duterte warned on Wednesday he would deal harshly with militants, after declaring martial law on Mindanao island following a failed raid on a hideout of Islamic State-linked rebels.","publishedAt":0,"title":"Philippines' Duterte says 'I'll be harsh' with army rule on island","url":"http://www.reuters.com/article/us-philippines-militants-idUSKBN18K08M","urlToImage":"//s3.reutersmedia.net/resources/r/?m=02&d=20170524&t=2&i=1186032942&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPED4N075","score":10.248142,"fetchedAt":0},{"author":"","description":"Philippine President Rodrigo Duterte warned Wednesday that he’ll be harsh in enforcing martial law in his country’s south as he abruptly left Moscow to deal with a crisis at home sparked by a Muslim extremist siege on a city, where militants burned buildings overnight and are feared to have taken hostages.","publishedAt":0,"title":"Duterte declares martial rule in besieged south Philippines","url":"https://www.washingtonpost.com/world/europe/duterte-declares-martial-rule-in-besieged-south-philippines/2017/05/23/4c1d678e-402c-11e7-b29f-f40ffced2ddb_story.html","urlToImage":"https://img.washingtonpost.com/rf/image_1484w/2010-2019/Wires/Online/2017-05-24/AP/Images/Russia_Phillipines_92576.jpg-b572a.jpg","score":8.3505335,"fetchedAt":0},{"author":"JIM GOMEZ and TERESA CEROJANO","description":"MANILA, Philippines (AP) — Philippine President Rodrigo Duterte warned Wednesday that he'll be harsh in enforcing martial law in his country's south as he abruptly left Moscow to deal with a crisis at home sparked by a Muslim extremist siege on a city, where militants burned buildings overnight and are feared to have taken hostages. Duterte declared martial rule for 60 days in the entire southern Mindanao region, the restive third of the Philippine archipelago, Tuesday evening to try to crush Muslim extremists who have aligned themselves with the Islamic State group and occupied a hospital, jail and other buildings and battled troops in an audacious attack in Marawi City.","publishedAt":0,"title":"Duterte declares martial rule in besieged south Philippines","url":"https://apnews.com/a2d52f83b0a84117833f3f51729e7b96","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:d77f666f41d6469ab01ae093e07c9d75/3000.jpeg","score":7.202282,"fetchedAt":0}]