[{"author":"Loulla-Mae Eleftheriou-Smith","description":"The suspected terrorist attack at Manchester Arena on Monday night that left 22 people dead and at least 59 injured took place four years to the day since the murder of Fusilier Lee Rigby.","publishedAt":0,"title":"Manchester attack comes four years to the day since the murder of Lee Rigby","url":"http://www.independent.co.uk/news/uk/crime/manchester-arena-explosion-lee-rigby-murder-four-year-day-terror-attack-anniversary-suicide-bomb-a7750576.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/04/21/08/9-lee-rigby-pa.jpg","score":7.160005,"fetchedAt":0},{"author":"Lucy Clarke-Billings","description":"The appalling massacre - which has left at least 22 people dead - took place on the same day as the fusilier was butchered by Islamic extremists Michael Adebolajo and Michael Adebowale","publishedAt":0,"title":"Manchester terror attack happened on anniversary of Lee Rigby's brutal murder","url":"http://www.mirror.co.uk/news/uk-news/manchester-arena-terror-attack-ripped-10479632","urlToImage":"http://i3.mirror.co.uk/incoming/article10479638.ece/ALTERNATES/s1200/PROD-Rigby-family-upset-over-memorialRigby-family-upset-over-memorial.jpg","score":7.160005,"fetchedAt":0},{"author":"","description":"LONDON (AP) — The Latest on the bombing at a pop concert in Manchester that left 22 people dead (all times local): 2:35 p.m. The father of the alleged Manchester arena attacker denies his son is linked to militants or the suicide bombing that killed 22 people. Ramadan Abedi says he spoke to his 22-year-old son, Salman Abedi, five days ago and he was getting ready to visit Saudi Arabia and sounded \"normal.\" He said that his son visited Libya a month-and-a -half ago. The elder Abedi told The Associated Press by telephone from Tripoli: \"We don't believe in killing innocents. This is not us.\" He said his other son, Ismail, was arrested in England on Tuesday morning. He said Salman was planning to head from Saudi Arabia to Libya to spend the holy month of Ramadan with family. Abedi fled Tripoli in 1993 after Moammar Gadhafi's security authorities issued an arrest warrant and eventually sought political asylum in Britain. Now, he is the administrative manager of the Central Security force in Tripoli.","publishedAt":0,"title":"The Latest: Father of alleged bomber declares son innocent","url":"https://apnews.com/8c18fc251d88471788998b97794e3bbe","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:e40ea2fb6bcc4caaab48df473745fd59/1602.jpeg","score":2.074969,"fetchedAt":0}]