[{"author":"Cork Gaines","description":"Fox News host Sean Hannity has come under fire in recent days for spreading unfounded conspiracies about the death of Seth Rich.","publishedAt":0,"title":"Raiders head coach Jack Del Rio defends Sean Hannity's extensive coverage of conspiracy theories involving Seth Rich","url":"http://www.businessinsider.com/jack-del-rio-sean-hannity-seth-rich-2017-5","urlToImage":"http://static2.businessinsider.com/image/586d1cf7ee14b61b008b66e3-1190-625/raiders-head-coach-jack-del-rio-defends-sean-hannitys-extensive-coverage-of-conspiracy-theories-involving-seth-rich.jpg","score":22.32852,"fetchedAt":0},{"author":"Ben Kew","description":"The brother of murdered DNC staffer Seth Rich has written a letter to Sean Hannity's producer asking the show not to host internet entrepreneur Kim DotCom.","publishedAt":0,"title":"Brother of Seth Rich Asks Hannity Not to Spread 'Conspiracy Theories' - Breitbart","url":"http://www.breitbart.com/big-government/2017/05/23/brother-of-seth-rich-asks-hannity-not-to-spread-conspiracy-theories/","urlToImage":"http://media.breitbart.com/media/2017/05/Seth-Rich-Sean-Hannity.jpg","score":13.052589,"fetchedAt":0},{"author":"","description":"Fox News retracted a story about the death of a Democratic National Committee staffer that was based on a groundless conspiracy theory. But host Sean Hannity, who pushed the theory, stood by it.","publishedAt":0,"title":"Fox News Retracts DNC Staffer Conspiracy Story, But Hannity Keeps It Alive","url":"http://www.npr.org/2017/05/24/529809256/fox-news-retracts-dnc-staffer-conspiracy-story-but-hannity-keeps-it-alive","urlToImage":"https://media.npr.org/assets/img/2017/05/24/gettyimages-472985446_wide-8da59b1ad92f3c44f70c67d41d1e3577dd065b83.jpg?s=1400","score":11.264389,"fetchedAt":0},{"author":"","description":"NEW YORK (AP) — Sean Hannity says a media watchdog is guilty of \"liberal fascism\" for targeting advertisers on his Fox News Channel show. One company announced Wednesday that it would no longer advertise there. The Chicago-based Cars.com said it had been watching Hannity's show closely and decided to suspend its backing. Hannity went on the attack against the organization Media Matters for America, which a day earlier had published a list of companies that had run commercials on his show this month. Advertising boycotts are a potent weapon in the media world, although Media Matters says it is not actively fomenting a boycott.","publishedAt":0,"title":"Hannity says liberal fascists after sponsors; 1 is leaving","url":"https://apnews.com/22f37ef0513e4fe4824b7b79d0dee09d","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:6219273ba8c94ed6bed4cab610028964/1635.jpeg","score":9.241644,"fetchedAt":0},{"author":"Oliver Darcy","description":"The brother of slain Democratic National Committee staffer Seth Rich wrote a letter on Tuesday to the executive producer of Sean Hannity's Fox News show pleading with him to find \"decency and kindness\" in his heart and stop spreading an unproven conspiracy theory about the unsolved murder.","publishedAt":0,"title":"Seth Rich's brother pleads with Hannity to stop spreading conspiracy theory","url":"http://money.cnn.com/2017/05/23/media/seth-rich-family-letter-hannity-fox-news/index.html","urlToImage":"http://i2.cdn.turner.com/money/dam/assets/170523120829-sean-hannity-seth-rich-letters-1-780x439.jpg","score":9.178869,"fetchedAt":0},{"author":"DAVID BAUDER","description":"NEW YORK (AP) — Fox News Channel's Sean Hannity said Tuesday he's backing off his speculation about the 2016 murder of Democratic National Committee employee Seth Rich after talking with Rich's family, which had appealed to the media to stop. The decision took Hannity off a potential collision course with his network, which earlier Tuesday had removed a week-old story about the case from its website because \"it was not initially subjected to the high degree of editorial scrutiny we require for all our reporting.\"","publishedAt":0,"title":"Hannity backs off story about murdered DNC staffer","url":"https://apnews.com/55f67345a78d4e25b90a8893948b53a5","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:6219273ba8c94ed6bed4cab610028964/1635.jpeg","score":7.718457,"fetchedAt":0}]