[{"author":"","description":"(AP) -- Nicki Minaj kicked off the 2017 Billboard Music Awards with an explosive nine-minute performance of her hit songs alongside her mentor Lil Wayne and frequent collaborator David Guetta.","publishedAt":0,"title":"Nicki Minaj Kicks Off Billboard Awards; Drake Early Winner","url":"https://www.bloomberg.com/news/articles/2017-05-21/drake-beyonce-early-winners-at-2017-billboard-music-awards","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iWxWdflpxNTo/v0/1200x746.jpg","score":27.334663,"fetchedAt":0},{"author":"Maeve McDermott","description":"Perry shared new song 'Swish Swish,' which also features Nicki Minaj, at midnight Friday.","publishedAt":0,"title":"Katy Perry's 'Swish Swish' angers Taylor Swift pal Ruby Rose","url":"https://www.usatoday.com/story/life/entertainthis/2017/05/19/katy-perrys-swish-swish-angers-taylor-swift-pal-ruby-rose/101869572/","urlToImage":"https://www.gannett-cdn.com/-mm-/05a161c41f06377c5ac96005ca27e6df94bf4c51/c=0-174-800-626&r=x633&c=1200x630/local/-/media/2017/05/19/USATODAY/USATODAY/636307806717423464-witness.JPG","score":16.64534,"fetchedAt":0},{"author":"MESFIN FEKADU","description":"Drake is cleaning house at the 2017 Billboard Music Awards, picking up 12 honors before the show was half over. The rapper won 10 awards in an early announcement Sunday and two before the live show was at the halfway mark at the T-Mobile Arena in Las Vegas. When picking up the top Billboard 200 album for \"Views,\" he told co-host Vanessa Hudgens she looks \"incredible\" and said to fellow host Ludacris, who Drake had problems with at one point, that he's \"always been a big fan.\" Drake also told Nicki Minaj that he's \"so glad we found our way back\" and thanked Lil Wayne for guiding their careers. He closed with an ode to his father: \"My dad got on purple suit and purple shoes!\"","publishedAt":0,"title":"Drake cleans house at Billboard Awards; Miley Cyrus performs","url":"https://apnews.com/d2e5c8e09e504f1eacddfcc95d2de5bc","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:b56c0708f9c04280a25788a98d286de1/3000.jpeg","score":5.071557,"fetchedAt":0}]