[{"author":"Karen DeYoung, Karen DeYoung","description":"The placement of the president’s visit is intended to affirm the administration’s view of the kingdom as the United States’ chief Arab and Muslim ally.","publishedAt":0,"title":"First stop on Trump’s first official trip overseas signals Saudi Arabia’s importance","url":"https://www.washingtonpost.com/world/national-security/first-stop-on-trumps-first-official-trip-overseas-signals-saudi-arabias-importance/2017/05/18/a70e9ba4-39c9-11e7-8854-21f359183e8c_story.html","urlToImage":"https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/05/18/Others/Images/2017-05-18/GettyImages-684507534.JPG","score":11.111888,"fetchedAt":0},{"author":"Jeremy Diamond and Zachary Cohen, CNN","description":"President Donald Trump signed a nearly $110 billion defense deal with Saudi Arabia's King Salman bin Abdulaziz Al Saud on Saturday, signaling the United States' renewed commitment to its alliance with the Gulf kingdom and desire to bolster its counterterrorism partnership.","publishedAt":0,"title":"Trump signs Kushner-negotiated $100B Saudi arms deal","url":"http://www.cnn.com/2017/05/19/politics/jared-kushner-saudi-arms-deal-lockheed-martin/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170518203934-01-jared-kushner-0518-super-tease.jpg","score":7.030972,"fetchedAt":0},{"author":"JONATHAN LEMIRE and JULIE PACE","description":"TEL AVIV, Israel (AP) — President Donald Trump opened his first visit to Israel Monday, an early visit by a president to a longtime Middle East ally and one aimed at testing the waters for jumpstarting the region's dormant peace process. Trump flew in from Saudi Arabia, where he basked in a lavish welcome from the kingdom's royal family, and received a similarly warm welcome in Tel Aviv. In brief remarks during an airport ceremony, the president said he had come \"to reaffirm the unbreakable bond between the United States and the state of Israel\" and that his visit with Arab leaders gave him \"new hope\" for peace in the region.","publishedAt":0,"title":"Trump to test waters for achieving Middle East peace","url":"https://apnews.com/6a1462f8dad542789e600afdfdf91e19","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:88dfa89ecf9748ed9c456e6f11fccfd2/2045.jpeg","score":4.3206983,"fetchedAt":0},{"author":"AYA BATRAWY","description":"DUBAI, United Arab Emirates (AP) — On his first overseas visit, President Donald Trump presided over a nearly $110 billion sale of military equipment to Saudi Arabia that made clear his administration did not see the kingdom's human rights record or its devastating war in Yemen as an obstacle to restoring ties that had been strained under his predecessor. The military agreement with Saudi Arabia, effective immediately, could expand up to $350 billion over 10 years. It appeared to reverse an Obama administration decision to pull back sales of precision-guided munitions to Saudi's armed forces over concerns sparked by a Saudi-led coalition bombing of a funeral hall in Yemen that killed more than 140 people.","publishedAt":0,"title":"Human rights concerns prove no obstacle in Trump-Saudi ties","url":"https://apnews.com/b180e554010942e19b62d8ccb2b05246","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:f38427f4ccac4f43a13040ad7f2e220e/3000.jpeg","score":3.3942647,"fetchedAt":0}]