[{"author":"Justina Crabtree","description":"President Donald Trump landed in Tel Aviv on Monday, in his first overseas visit since taking office.","publishedAt":0,"title":"We have a ‘rare opportunity’ to bring peace to the Middle East: Trump","url":"http://www.cnbc.com/2017/05/22/watch-trump-speaks-from-israel.html","urlToImage":"http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/19/104481886-RTX36N4E.1910x1000.jpg","score":15.416481,"fetchedAt":0},{"author":"Deborah Danan","description":"TEL AVIV - Jewish American organizations from the right and left hailed President Donald Trump's visit to Israel as a resounding success.","publishedAt":0,"title":"Jewish Organizations Praise Trump's Historic Israel Visit","url":"http://www.breitbart.com/jerusalem/2017/05/24/jewish-organizations-praise-trumps-israel-visit/","urlToImage":"http://media.breitbart.com/media/2017/05/djt.jpg","score":15.416481,"fetchedAt":0},{"author":"Aaron Klein","description":"Former Arkansas Governor Mike Huckabee hailed President Trump’s trip to Israel and him to move the U.S. embassy from Tel Aviv to Jerusalem.","publishedAt":0,"title":"EXCLUSIVE – Mike Huckabee to Trump: Ignore Detractors and Move U.S. Embassy to Jerusalem","url":"http://www.breitbart.com/jerusalem/2017/05/22/exclusive-mike-huckabee-trump-ignore-detractors-move-u-s-embassy-jerusalem/","urlToImage":"http://media.breitbart.com/media/2015/09/Mike-huckabee-flag-Getty.jpg","score":13.827805,"fetchedAt":0},{"author":"Ali Vitali, Abigail Williams","description":"President Donald Trump arrived in Tel Aviv on Monday, hoping to help push forward what he's described as the \"ultimate deal.\" NBCNews reports.","publishedAt":0,"title":"Trump arrives in Israel aiming to seal the 'ultimate deal'","url":"http://www.nbcnews.com/storyline/trump-s-first-foreign-trip/donald-trump-arrives-israel-will-push-peace-process-n762816","urlToImage":"http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/22/104484255-GettyImages-686665032.1910x1000.jpg","score":13.827805,"fetchedAt":0},{"author":"Penny Starr","description":"It started with a Detroit Free Press reporter tweeting that when President Donald Trump attempts to hold Melania’s hand as they arrived in Tel Aviv, the first lady “slaps away” her husband’s hand.","publishedAt":0,"title":"FAKE NEWS: Media Attempts to Malign Melania and Her Marriage on Trip Abroad - Breitbart","url":"http://www.breitbart.com/big-government/2017/05/22/fake-news-media-attempts-to-malign-melania-and-her-marriage-on-trip-abroad/","urlToImage":"http://media.breitbart.com/media/2017/05/Trumps-not-holding-hands-Screen-Shot-2017-05-22-at-10.08.25-AM.jpg","score":11.933131,"fetchedAt":0},{"author":"FOCUS Online","description":"Weltweit gab es Spott für US-Präsident Trump, als er in Tel Aviv beim Versuch scheiterte, die Hand seiner Frau zu ergreifen. Bei der Ankunft des Paares in Rom kam es nun zu einer ähnlichen Szene.","publishedAt":0,"title":"US-Präsident in Rom: Als Donald ihr die Hand reicht, zieht Melania zurück","url":"http://www.focus.de/politik/videos/donald-trump-in-rom-melania-schlaegt-dem-us-praesidenten-die-hand-weg_id_7173317.html","urlToImage":"http://p5.focus.de/img/fotos/crop7173316/1212717042-w1200-h627-o-q75-p5/59254018e4b06d3c9bfbfbd6-568x320-1-may-24-2017-9-18-08-poster.jpg","score":9.723545,"fetchedAt":0},{"author":"Rachel Hosie","description":"Yesterday US President Donald Trump and his wife Melania arrived at Ben Gurion International Airport in Tel Aviv. As always, the eyes of the public were watching their every move, and much has been made of a particular public moment between the couple. After disembarking from the plane, the President walks ahead of his wife and holds his hand back for her to take.","publishedAt":0,"title":"Body language expert reveals what it really means that Melania swatted Trump's hand away","url":"http://www.independent.co.uk/life-style/melania-trump-donald-slap-hand-israel-visit-us-first-lady-president-child-treated-body-language-a7750871.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/23/10/trump-melania-tel-aviv.jpg","score":7.251668,"fetchedAt":0},{"author":"ILAN BEN ZION","description":"JERUSALEM (AP) — Even before President Donald Trump began his trip to Israel, he already may have made history. The president's flight from Riyadh to Tel Aviv on Monday was believed to be the first direct flight between Saudi Arabia and Israel. Trump landed at Ben-Gurion International Airport for a two-day visit to Israel and the Palestinian territories as part of his first trip abroad since taking office. An Israel Airport Authority spokesman said he was not aware of any direct flights ever having landed in Israel from the kingdom.","publishedAt":0,"title":"Trump trip to Israel possibly first flight from Saudi Arabia","url":"https://apnews.com/337240bffbee4be08ddcd9c87f71213b","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:ce1fd6f1c4b94a668294163e81ac0247/3000.jpeg","score":5.96271,"fetchedAt":0},{"author":"ILAN BEN ZION","description":"JERUSALEM (AP) — President Donald Trump got an abrupt Israeli welcome on his arrival in Tel Aviv on Monday, with ministers asking favors and snapping selfies as they sought to get a piece of the commander in chief's attention. Walking down the red carpet upon landing at Ben-Gurion International Airport, the president was greeted by dignitaries exhibiting the blunt forwardness and informality for which Israelis are known. Trump asked Israeli Prime Minister Benjamin Netanyahu what protocol was as they approached the dais before delivering their speeches. Netanyahu threw up his hands and replied: \"Who knows?\"","publishedAt":0,"title":"Trump greeted with selfies and politics on arrival in Israel","url":"https://apnews.com/e33ac101e2d14e5585fef468eda17a35","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:6f28dcd198f042b2b6b09c96ae7158ec/2170.jpeg","score":5.96271,"fetchedAt":0},{"author":"LEANNE ITALIE","description":"Iris Azulai's 17-year-old daughter, Carmel, recently attended a large concert in Tel Aviv of the Argentine singer Lali. Given Israel's history, the fear of terrorism is always lurking, particularly at mass events, but regardless, she would not have prevented her daughter from going. \"There is always that fear ... but I allow her to go because I say we cannot allow terrorism to take over our lives,\" the mother said Tuesday following the Ariana Grande tragedy in Manchester, England. \"It can happen anywhere and I just ask my daughter to be aware and take note of her surroundings.\"","publishedAt":0,"title":"Parents weigh in on concert fears after Manchester","url":"https://apnews.com/f9bd174a87d24009a5b6d9552dddc5f8","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:91caed6545644fce984a7585b8565e96/3000.jpeg","score":5.96271,"fetchedAt":0}]