[{"author":"Tom Jensen                    \n\n                                    \n                        @tomjensen100","description":"The waterfront Florida mansion of the late NASCAR CEO Bill France Jr. will be sold at auction.","publishedAt":0,"title":"Mansion formerly owned by Bill France Jr. and Betty Jane France up for sale | FOX Sports","url":"http://www.foxsports.com/nascar/story/mansion-formerly-owned-by-bill-france-jr-and-betty-jane-france-up-for-sale-052317","urlToImage":"http://b.fssta.com/uploads/2017/05/bill-france-jr-house.vresize.1200.630.high.0.jpg","score":12.953512,"fetchedAt":0},{"author":"FourFourTwo","description":"Zinedine Zidane, 44, is already being earmarked for the France job, according to Frank Leboeuf.","publishedAt":0,"title":"Madrid boss Zidane will be next France coach, says Leboeuf","url":"https://www.fourfourtwo.com/news/madrid-boss-zidane-will-be-next-france-coach-says-leboeuf","urlToImage":"https://images.cdn.fourfourtwo.com/sites/fourfourtwo.com/files/zidane-cropped_5m91s2y72qeb1uzwdta32j5bb.jpg","score":11.846573,"fetchedAt":0},{"author":"FourFourTwo","description":"England have omitted Wayne Rooney for June's double-header against Scotland and France, casting doubt over his international future.","publishedAt":0,"title":"Rooney left out of England squad to play Scotland and France","url":"https://www.fourfourtwo.com/news/rooney-left-out-england-squad-play-scotland-and-france","urlToImage":"https://images.cdn.fourfourtwo.com/sites/fourfourtwo.com/files/rooney-cropped_1mevjgpg84ucqzcnxb1s7rgiv.jpg","score":11.212519,"fetchedAt":0},{"author":"Robin Emmott and John Irish","description":"France and Germany will agree to a U.S. plan for NATO to play a bigger role in the fight against Islamic militants at a meeting with President Donald Trump on Thursday, but insist the move is purely symbolic, four senior European diplomats said.","publishedAt":0,"title":"France, Germany to agree to NATO role against Islamic State: diplomats","url":"http://www.reuters.com/article/us-usa-trump-nato-idUSKBN18K2A1","urlToImage":"//s3.reutersmedia.net/resources/r/?m=02&d=20170524&t=2&i=1186117352&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPED4N1GQ","score":10.456902,"fetchedAt":0},{"author":"","description":"BRUSSELS (AP) — U.S. President Donald Trump met his match in a handshake showdown with France's new president, Emmanuel Macron. At their first meeting, ahead of a NATO summit in Brussels on Thursday, the two men locked hands for so long that knuckles started turning white. Trump finally seemed ready to pull away — but Macron evidently wasn't. The French leader held the shake for a few seconds more. Both men's jaws seemed to clench. Trump has described himself as \"a germ freak\" and called handshakes \"barbaric.\" In his 1997 book \"The Art of the Comeback,\" Trump wrote he'd \"often thought of taking out a series of newspaper ads encouraging the abolishment of the handshake.\"","publishedAt":0,"title":"Trump handshake showdown: France's Macron just won't let go","url":"https://apnews.com/c72427ebda784cc7abe352582eb3bb4f","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:7ec4ee858fd542dca59ef9c961688e28/2000.jpeg","score":8.079829,"fetchedAt":0},{"author":"talkSPORT","description":"Gael Clichy has confirmed he will NOT be a Manchester CIty player next season. The France defender, who joined City in the summer of 2011, is out of contract at the end of the 2016/17 season and will not be signing a new deal with the Etihad Stadium club. When asked at a question and answer session if he would be playing with Joe Hart next season, the 31-year-old said: \"It's hard. I'm not sure whether or not Joe will be here next season, and I won't be here next season.\"","publishedAt":0,"title":"Gael Clichy: France defender confirms he is leaving Manchester City when his contract expires in the summer","url":"http://talksport.com/football/gael-clichy-france-defender-confirms-he-leaving-manchester-city-when-his-contract-expires","urlToImage":"http://talksport.com/sites/default/files/field/image/201705/gettyimages-682695372.jpg","score":7.430097,"fetchedAt":0},{"author":"talkSPORT","description":"Antoine Griezmann has cast further doubt over his future at Atletico Madrid by admitting he is 'ready to go' in order to win trophies. The France striker revealed on Monday there was a 'six out of 10' chance of him joining Manchester United this summer. The 26-year-old has been consistently linked with a move to Old Trafford in recent months and it now seems there could be some substance to the speculation.","publishedAt":0,"title":"Atletico Madrid and France forward Antoine Griezmann fuels Manchester United rumours by admitting: 'I'm ready to go'","url":"http://talksport.com/football/atletico-madrid-and-france-forward-antoine-griezmann-fuels-manchester-united-rumours","urlToImage":"http://talksport.com/sites/default/files/field/image/201705/gettyimages-681608048.jpg","score":7.430097,"fetchedAt":0},{"author":"talkSPORT","description":"Wayne Rooney will not be part of the England squad for the internationals against Scotland and France in June. The Manchester United striker is his country's record goalscorer, having netted 53 times in 119 appearances for the Three Lions. But it appears as though his international career could be now be over. He was left out of Gareth Southgate's squad for the games against Germany and Lithuania earlier this year. And Southgate has decided to snub Rooney once more for next month's internationals, talkSPORT has learned.","publishedAt":0,"title":"Gareth Southgate to leave England's record goalscorer Wayne Rooney out of his squad for Scotland and France clashes","url":"http://talksport.com/football/gareth-southgate-leave-englands-record-goalscorer-wayne-rooney-out-his-squad-scotland-and","urlToImage":"http://talksport.com/sites/default/files/field/image/201705/gettyimages-686306554.jpg","score":7.430097,"fetchedAt":0},{"author":"talkSPORT","description":"Wayne Rooney has NOT been named in Gareth Southgate's England squad for the upcoming matches against Scotland and France. The Three Lions' record goalscorer made only 25 Premier League appearances for Manchester United this season - with just 15 of those as a starter. Rooney has not played for England since November 2016, having missed the previous three squads with injury, and his international future is now most certainly in doubt.","publishedAt":0,"title":"England squad for matches against Scotland and France CONFIRMED: Wayne Rooney out, Harry Kane and Jack Butland return","url":"http://talksport.com/football/england-squad-matches-against-scotland-and-france-confirmed-wayne-rooney-out-harry-kane-and","urlToImage":"http://talksport.com/sites/default/files/field/image/201705/pjimage_11.jpg","score":7.430097,"fetchedAt":0},{"author":"Samuel Luckhurst","description":"The France international is understood to be the top transfer priority at Old Trafford this summer","publishedAt":0,"title":"Griezmann discusses Manchester United transfer on French TV","url":"http://www.mirror.co.uk/sport/football/transfer-news/antoine-griezmann-discusses-manchester-united-10478141","urlToImage":"http://i2.mirror.co.uk/incoming/article10478144.ece/ALTERNATES/s1200/Antoine-Griezmann.jpg","score":7.096709,"fetchedAt":0}]