[{"author":"","description":"Helicopters and special forces used against Maute group fighters who have held the city on Mindanao island for two days","publishedAt":0,"title":"Philippines steps up bid to drive Isis-linked group from Marawi","url":"https://www.theguardian.com/world/2017/may/25/philippines-steps-up-bid-to-drive-isis-linked-group-from-marawi","urlToImage":"https://i.guim.co.uk/img/media/74bc446ca13726e4db55e835a21bc438920d2307/0_253_4000_2400/master/4000.jpg?w=1200&h=630&q=55&auto=format&usm=12&fit=crop&crop=faces%2Centropy&bm=normal&ba=bottom%2Cleft&blend64=aHR0cHM6Ly91cGxvYWRzLmd1aW0uY28udWsvMjAxNi8wNS8yNS9vdmVybGF5LWxvZ28tMTIwMC05MF9vcHQucG5n&s=329875c135ce4ba2feb5d365d730aec1","score":13.360596,"fetchedAt":0},{"author":"Felipe Villamor","description":"Militants belonging to Abu Sayyaf and Maute, two terrorist groups affiliated with the Islamic State, were accused of killing a police officer and two soldiers.","publishedAt":0,"title":"Mindanao, a Philippines Island, Is Placed Under Martial Law","url":"https://www.nytimes.com/2017/05/23/world/asia/mindanao-philippines-duterte-martial-law.html","urlToImage":"https://static01.nyt.com/images/2017/05/24/world/24philippines/24philippines-facebookJumbo.jpg","score":11.981054,"fetchedAt":0},{"author":"JIM GOMEZ and TERESA CEROJANO","description":"MANILA, Philippines (AP) — Muslim extremists abducted a Catholic priest and more than a dozen churchgoers while laying siege to a southern Philippine city overnight, burning buildings, ambushing soldiers and hoisting flags of the Islamic State group, officials said Wednesday. President Rodrigo Duterte declared martial law in the southern third of the nation and warned he would enforce it harshly. The violence erupted Tuesday night after the army raided the hideout of Isnilon Hapilon, an Abu Sayyaf commander who is on Washington's list of most-wanted terrorists with a reward of up to $5 million for his capture. The militants called for reinforcements from an allied group, the Maute, and some 50 gunmen managed to enter the city of Marawi.","publishedAt":0,"title":"Priest among 14 hostages taken in siege of Philippines city","url":"https://apnews.com/d7533b764de7457a872a0f3935cebb55","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:257fa563d72f442b8eb4abc18b3e7c65/3000.jpeg","score":5.159627,"fetchedAt":0}]