[{"author":"Natalie Evans","description":"Kim Jong-un's launch follows the successful test last week of another missile that has put Hawaii and Alaska within range","publishedAt":0,"title":"North Korea tests medium-range missile fuelling fears over its ability to hit US","url":"http://www.mirror.co.uk/news/world-news/north-korea-successfully-tests-medium-10473279","urlToImage":"http://i3.mirror.co.uk/incoming/article10473291.ece/ALTERNATES/s1200/North-Korea-missile.jpg","score":7.12558,"fetchedAt":0},{"author":"FOCUS Online","description":"Drei Monate Ferien auf Hawaii – davon träumen viele Urlauber. Eine Australierin wollte sich diesen Wunsch erfüllen. Doch amerikanische Grenzbeamte verhafteten die junge Frau am Flughafen – wegen ihrer privaten Notizen.","publishedAt":0,"title":"Gefängnis statt Urlaub: US-Grenzbeamte verhaften junge Frau wegen ihres Tagebuchs","url":"http://www.focus.de/reisen/videos/gefaengnis-statt-urlaub-us-grenzbeamte-verhaften-junge-frau-wegen-ihres-tagebuchs_id_7165636.html","urlToImage":"http://p5.focus.de/img/fotos/crop7165635/6582715647-w1200-h627-o-q75-p5/5922e879e4b06d3c9bfbeff9-568x320-1-may-22-2017-13-37-53-poster.jpg","score":5.013595,"fetchedAt":0},{"author":"MICHAEL BALSAMO","description":"LOS ANGELES (AP) — A man acted strangely long before he caused a disturbance on a plane that prompted fighter jets to accompany it to Hawaii, but a lack of communication and an airline's hesitancy to be caught on video booting a passenger could have played a role in allowing him to fly, experts say. Anil Uskanli, 25, of Turkey, had purchased a ticket at an airline counter in the middle of the night with no luggage and had been arrested after opening a door to a restricted airfield at Los Angeles International Airport. Airport police did not notify the airline, but they said it isn't common practice.","publishedAt":0,"title":"Experts: Lack of communication before plane disturbance","url":"https://apnews.com/c27c975ce28f4545abfa012fcfa1146b","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:3ab270c08f414b469fd72173fe455f8e/2048.jpeg","score":3.076129,"fetchedAt":0}]