[{"author":"Brian K Sullivan","description":"Spring dumped so much rain on the U.S. that most of the country is drought-free for the first time in decades. But in parched Florida and Georgia, wildfires have destroyed hundreds of thousands of acres of forests and pastureland.","publishedAt":0,"title":"Florida's Bone Dry and Burning While Rest of U.S. Is Soaking Wet","url":"https://www.bloomberg.com/news/articles/2017-05-19/florida-s-bone-dry-and-burning-while-rest-of-u-s-is-soaking-wet","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iIbKYY2f0PsE/v0/1200x800.jpg","score":13.521272,"fetchedAt":0},{"author":"Michele Gorman","description":"This year Republican legislators are trying to expand the Stand Your Ground law in Florida and issue NRA vanity license plates in Washington State.","publishedAt":0,"title":"Here are some states’ 2017 gun bills","url":"http://www.newsweek.com/state-gun-bills-you-never-knew-existed-609611","urlToImage":"http://s.newsweek.com/sites/www.newsweek.com/files/2017/05/15/0515stategunbills01.jpg","score":6.8844266,"fetchedAt":0},{"author":"Spiegel Online","description":"Der Vize-Gouverneur von Florida hat eine Pythonschlange gefangen und sich damit in Szene gesetzt. Was nach Prahlerei aussieht, hat einen ernsten Hintergrund. Die Live-News.","publishedAt":0,"title":"+++ Der Morgen live +++: US-Politiker posiert mit toter Riesenschlange","url":"http://www.spiegel.de/politik/deutschland/nachrichten-am-morgen-die-news-in-echtzeit-a-1147186.html","urlToImage":"http://cdn1.spiegel.de/images/image-1143008-galleryV9-rxwn-1143008.jpg","score":5.937626,"fetchedAt":0},{"author":"FRAZIER MOORE","description":"NEW YORK (AP) — Roger Ailes, the communications maestro who transformed television news and America's political conversation by creating and ruling Fox News Channel for two decades before being ousted last year for alleged sexual harassment, died Thursday, according to his wife, Elizabeth Ailes. He was 77. Ailes died after a fall at his Palm Beach home on May 10 caused bleeding on the brain, the Palm Beach County Medical Examiner's Office said. Ailes fell in his bathroom, hit his head and was bleeding profusely. He was taken to a hospital by attending paramedics, the Palm Beach (Florida) Police Department said.","publishedAt":0,"title":"Fox News founder Roger Ailes died of complications from fall","url":"https://apnews.com/85f4c3bbf6b54888a82ab3a146580d1b","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:649f04ec581a47358d54d8aa692657f1/2634.jpeg","score":2.9613934,"fetchedAt":0},{"author":"","description":"FORT LAUDERDALE, Fla. (AP) — The U.S. Coast Guard unloaded cocaine in South Florida worth nearly $500 million from 20 separate seizures in the eastern Pacific Ocean. Coast Guard officials said in a news release Thursday the seizures totaled about 18.5 tons (about 18.8 metric tons) of cocaine. The recently seized drugs were brought to Port Everglades by the cutter Hamilton. Authorities say the cocaine was intercepted along the Central and South American coasts by Coast Guard cutters and a Royal Canadian Navy ship sailing with a Coast Guard team aboard. The eastern Pacific is a prime smuggling route for cocaine headed to Mexico, where it is typically brought into the U.S.","publishedAt":0,"title":"Coast Guard unloads $500M in cocaine from 20 seizures","url":"https://apnews.com/29b39bc8e846421b8e88dac555bd5167","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:3fce4606da4c4476a0a5f79b4b183353/2601.jpeg","score":2.9613934,"fetchedAt":0},{"author":"","description":"The '17 NBA Draft is incredibly deep, with all 30 first-round picks likely to produce for their teams sooner than later. Here's the lottery order and a first-round mock. 1. Boston Celtics: Markelle Fultz, PG, Washington (Freshman) 2. Los Angeles Lakers: Lonzo Ball, PG, UCLA (Freshman) 3. Philadelphia 76ers: Malik Monk, G, Kentucky (Freshman) 4. Phoenix Suns: Josh Jackson, SF, Kansas (Freshman) 5. Sacramento Kings: De'Aaron Fox, PG, Kentucky (Freshman) 6. Orlando Magic: Lauri Markkanen, PF, Arizona (Freshman) 7. Minnesota Timberwolves: Jonathan Isaac, F, Florida State (Freshman) 8. New York Knicks: Jayson Tatum, SF, Duke (Freshman) 9. Dallas Mavericks: Dennis Smith Jr., PG, North Carolina State (Freshman)","publishedAt":0,"title":"2017 NBA mock draft and lottery results | FOX Sports","url":"http://www.foxsports.com/nba/video/946026563659","urlToImage":"http://b.fssta.com/uploads/2017/05/d9c28eed-aedd-4621-9276-b48ded768028_1280x720_946028099536.vresize.1200.630.high.0.jpg","score":2.323813,"fetchedAt":0}]