[{"author":"Rachel Kaser","description":"Duolingo announced today that it was adding Japanese to its language courses.\r\n\r\nThe course teaches English-speaking users the hiragana syllabary in addition to Japanese phrases, with ...","publishedAt":0,"title":"Duolingo adds Japanese to its catalog of languages","url":"https://thenextweb.com/apps/2017/05/18/duolingo-adds-japanese-catalog-languages/","urlToImage":"https://cdn1.tnwcdn.com/wp-content/blogs.dir/1/files/2017/05/Duolingo-Japanese.jpg","score":11.02054,"fetchedAt":0},{"author":"","description":"The overwhelming information abundance we are facing now is nothing new. It has started long time ago. Instead of solving this problem we decided to dance around it. And out came a whole new industry; SEO. Long story short, We want to replace Google and build one search engine for every country.\n\n\n\n No giggling at the back, please\n\n\n\n \n\n\n\n Image copyright Wikimedia Commons\n\n\n\n We are living in an era where information overload is beyond comprehension. If you use one search engine for the whole internet it won’t work most of the time. Be it information, news or product, job. We want to build one search engine for every single country to overcome this ordeal.\n\n\n\n The enormous scale of the today’s data is beyond comprehension. And it’s growing exponentially every day. And it’s getting worse everyday. Now a days every country alone generates a large volume of data everyday. The World Wide Web has passed a long journey. It’s not only about the global information we seek. It has become a part and parcel of our everyday life. We do use it in most of modern day services.\n\n\n\nSearch is not a Q/A\n\n\n\n Information we seek in internet are of mainly two types:\n\n\n\n \n We know what we are looking for\n\n\n We don’t know what we are looking for\n\n\n\n Either way traditional search engines behave to get you a list of possible items with almost no way to drill it down.\n\n\n\n One search engine for the whole internet will make you to search multiple times to get what you want.\nThe idea behind it is you ask a question and it will show you a possible list of items. That’s it!\n\n\n\n There are others (amazon, linkedin, netflix) who would get you filters but those are focused on one type of information. also called vertical search engine\n\n\n\n \n Search within results\n\n\n Facet\n\n\n Tag based taxonomy\n\n\n Range queries\n\n\n\n These features could become very handy in this case. Search is more like a journey to seek what you are looking for. It’s an experience. We believe the search engine should guide you through the journey. It might ask you questions while doing it and help you act accordingly. It should also recommend you items based on your interaction.\n\n\n\nSystems who restrict this information overflow are becoming popular\n\n\n\n If we look into the recent popular systems it’s prevalent that people are tired of this information overload. That’s why systems like twitter, vine, periscope, snapchat became so popular. It’s the time to remove the clutters in search engine.\n\n\n\nNot everyone speaks English\n\n\n\n If we use one search engine for the whole internet it gotta be in english. There is no doubt about that. But there are at least 500 languages in the world. and Everyone adore theirs’. There is one country who has even fought a bloody war to speak their minds in their own language. Bangladesh it is!\nAlmost everything of black and white is in Bangla for them. We know there are others as well who does the same.\n\n\n\nThere are new technologies which could play a vital role in Information Retrieval systems\n\n\n\n Since we decided to come up with the idea of SEO instead of decentralising it there has been a lot of new algorithms, design patterns immerged. Big players seems not interested in those. We decided to embrace it. We integrated CLIR Cross Language Information Retrieval. It means when you search for an english word it would also get you items with it’s meaning and vice versa. If you want to see it in action please visit \n\n\n\nOne search engine can never be realtime\n\n\n\n Every country is generating a lot of data everyday. Using one search engine could never be realtime. You will notice that the search results are horribly outdated. I won’t blame anybody. It really takes time to crawl a whole website and get back to it for a recrawl.\n\n\n\nImportant information also served in local outlets\n\n\n\n The world has become smaller in terms of communication. We know the important stuff around the world instantly as it happens. This made it obvious that the same information is also published in native languages. There are many people who would understand better if it were in their mother tongue.\n\n\n\nThere was a time when Yahoo was the most important company in the internet\n\n\n\n Sooner or later the internet will have to be decentralized. It already started happening. We started with khujun.com a vertical search engine, specifically made for Bangladesh. We crawl only a specific list of websites relevant to this country. People are loving it.\nWe are working to release it in Saudi Arabia, Nigeria and Mexico.\n\n\n\nUser should be in control and see everything in result\n\n\n\n For instance the website crawl metadata and result scoring should be displayed to the user. Also we think if it has an image to represent the content it should be shown as a thumbnail. Which we do. We are also let the user sort the results based on the data.\n\n\n\nThere are so many valid results for a query\n\n\n\n Let’s say we are looking for the price offerings of iPhone among the local ecommerce websites. As of now we can use Google’s country specific search. and this is what I got (notice url country specific tld in screenshot):\n\n\n\n \n\n\n\n Every country has a mammoth collection of valid results for your query. The idea of one search engine will end up with reverse engineering the search algorithm behind it. While we could have decentralised it in the very first time. It is a bad idea to use one search engine for the whole internet.\n\n\n\n PS: I have tremendous respect to Google for what they did and doing. Information on this post is only my opinion. No pun intended. If you have any thoughts about this post I would love to converse with you about it. You can reach me at twitter. My handle is @ferdous","publishedAt":0,"title":"One search engine for the whole internet is not a good idea anymore!","url":"http://dynamicguy.com/post/160792434677/1-search-engine-not-good-anymore","urlToImage":"","score":1.6554385,"fetchedAt":0}]