[{"author":"Jen Skerritt","description":"Canada’s dairy industry, which receives tariff and quota protections from its government, has drawn the ire of U.S. President Donald Trump, who blames Canada for millions of dollars in lost sales for U.S. milk producers. In this, Trump isn’t alone. Other nations also worry that Canada may start dumping low-cost milk products on the international market, exacerbating a global glut that’s weighed on prices and led to losses all over the world.","publishedAt":0,"title":"Why Milk Creates Anger Across U.S.-Canada Border: QuickTake Q&A","url":"https://www.bloomberg.com/politics/articles/2017-05-23/why-milk-creates-anger-across-u-s-canada-border-quicktake-q-a","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iOV6Bl4Nyzds/v0/1200x800.jpg","score":13.779367,"fetchedAt":0},{"author":"Doug Alexander","description":"HSBC Holdings Plc is getting aggressive in Canada -- and one needs to look no further than its latest mortgage rate for proof of broader ambitions.","publishedAt":0,"title":"HSBC Makes 'Big Bet' on Canada in Bid for More Market Share","url":"https://www.bloomberg.com/news/articles/2017-05-23/hsbc-makes-big-bet-on-canada-in-bid-for-more-market-share","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/isxqsAORSikw/v0/1200x800.jpg","score":13.222921,"fetchedAt":0},{"author":"Tim Hepher and Alwyn Scott","description":"Two words underpin Boeing's (BA.N) decision to launch a U.S. trade complaint against Bombardier (BBDb.TO), which plunged it into a row with Canada last week: \"Never again\".","publishedAt":0,"title":"In Bombardier fight, Boeing sees ghost of Airbus ascent","url":"http://www.reuters.com/article/us-boeing-bombardier-analysis-idUSKBN18I23L","urlToImage":"http://s1.reutersmedia.net/resources/r/?m=02&d=20170522&t=2&i=1185758552&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPED4L1B1","score":5.762236,"fetchedAt":0},{"author":"","description":"NAVAL AIR STATION SIGONELLA, Italy (AP) — The Latest on President Donald Trump's first trip abroad (all times local): 11 p.m. President Donald Trump is opening the final leg of his maiden international trip, landing in Italy for meetings with the Group of 7 leaders. Trump and leaders from some of the world's wealthiest nations will hold wide-ranging talks on foreign affairs, including terrorism, trade and economic growth in Taormina, Italy. The White House is expects Trump to be pressed by many of the G-7 leaders to stay in the Paris climate accord. Trump has said he's waiting until after he returns to Washington to make a decision on whether to withdraw from the deal, which was agreed to by the Obama administration. The other G-7 leaders are Britain, Canada, France, Germany, Italy, and Japan. Trump flew to the Italian island of Sicily from Brussels, where he attended NATO meetings and met with European Union officials.","publishedAt":0,"title":"The Latest: Trump arrives in Italy for G-7 summit","url":"https://apnews.com/23a35ac5074f4b129ce6896f3c095063","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:669a52bef7314877bd2032e37789dc0e/2353.jpeg","score":2.258189,"fetchedAt":0}]