[{"author":"JULIE PACE and JONATHAN LEMIRE","description":"BRUSSELS (AP) — Surrounded by stone-faced allies, President Donald Trump rebuked fellow NATO members Thursday for failing to meet the military alliance's financial benchmarks, asserting that leaves it weaker and shortchanges \"the people and taxpayers of the United States.\" Trump, who has often complained back home about other nations' NATO support, lectured the other leaders in person this time, declaring, \"Many of these nations owe massive amounts of money from past years.\"","publishedAt":0,"title":"Trump scolds fellow NATO leaders: Spend more for military","url":"https://apnews.com/2ed02c1ee7c64061a2bf146bfb0a4b2c","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:68c3e6cc069a46b387bf916a87bfa723/3000.jpeg","score":8.503902,"fetchedAt":0},{"author":"LORNE COOK","description":"BRUSSELS (AP) — It sounds strange to characterize the North Atlantic Treaty Organization as a huge gun club, but the comparison can be useful in understanding the world's biggest military alliance. Like many gun clubs, NATO actually has no weapons of its own. The battleships, war planes, missiles and potential pool of more than 3 million personnel are owned and brought to the range by the 28 member states, mostly at their own cost. The only military equipment NATO has is a fleet of early warning radar planes and, from next year, five surveillance drones.","publishedAt":0,"title":"NATO, the world's biggest military alliance, explained","url":"https://apnews.com/540defb22dd640dbad015767ef60ebb1","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:abe731e2e4054429b4c2695066b3c498/3000.jpeg","score":7.1026134,"fetchedAt":0},{"author":"LORNE COOK","description":"BRUSSELS (AP) — NATO is not only rolling out the red carpet for U.S. President Donald Trump in Brussels Thursday, the military alliance — which Trump once declared obsolete — has been busy repackaging its image and is ready to unveil a new headquarters worth more than 1 billion euros. In recent months, member nations have strained to show they are ramping up defense spending as Trump has demanded, even though they have been doing so for a few years in response to an aggressive Russia. And while they agree with the chief of the alliance's most powerful member that NATO can do more to fight terrorism, they say it can be achieved with more of the same; training and mentoring troops in Afghanistan, and equipping local forces in Iraq so they can better fight the Islamic State group themselves.","publishedAt":0,"title":"NATO rolls out the red carpet, buffs its image for Trump","url":"https://apnews.com/1e412fe9983747a6a8f94a2356d31f96","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:46bfeb4eec4b41a6a85c39e544a46e3c/2160.jpeg","score":6.871063,"fetchedAt":0}]