[{"author":"Penny Starr","description":"Secretary of Interior Ryan Zinke called President Trump's proposed budget for fiscal year 2018 a “new foundation for American greatness.”","publishedAt":0,"title":"Zinke On Interior Budget: Obama $15 Billion Revenue Cuts Enough to Pay for Entire Maintenance Backlog for National Parks","url":"http://www.breitbart.com/big-government/2017/05/24/zinke-on-interior-budget-obama-15-billion-revenue-cuts-enough-to-pay-for-entire-maintenance-backlog-for-national-parks/","urlToImage":"http://media.breitbart.com/media/2017/03/Ryan-Zinke-ap.jpg","score":15.897446,"fetchedAt":0},{"author":"","description":"BOZEMAN, Mont. (AP) — The Latest on the assault case against Greg Gianforte, the Republican candidate for a Montana congressional seat in a Thursday special election. (all times local): 5 a.m. The Guardian reporter who authorities say was assaulted by a Montana Republican candidate for a U.S. House seat says he never touched the politician before he was thrown to the ground. Ben Jacobs told ABC's \"Good Morning America\" that he was doing his job and asking a question of candidate Greg Gianforte as part of covering Thursday's special election. Gianforte was charged with misdemeanor assault. He's accused of grabbing Jacobs by the throat and throwing him to the ground in his campaign office Wednesday night. Gianforte's campaign blamed Jacobs, saying the reporter was being aggressive and grabbed Gianforte. Jacobs said Thursday of Gianforte's account that \"the only thing that is factually correct ... is my name and place of employment.\" Gianforte and Democrat Rob Quist are seeking to fill the U.S. House seat left vacant when Ryan Zinke resigned to join Trump's Cabinet as secretary of the Interior Department.","publishedAt":0,"title":"The Latest: Journalist says Gianforte's account incorrect","url":"https://apnews.com/f35a59d62b93423caedcdf57bf1e6a89","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:db778d440e524fa9a6c9bf9ebf937a48/3000.jpeg","score":3.5422325,"fetchedAt":0}]