[{"author":"Ben Kew","description":"Fox News host Kimberly Guilfoyle has suggested she would be interested in replacing Sean Spicer as White House press secretary, amid reports Spicer could soon be released from the role.","publishedAt":0,"title":"Kimberly Guilfoyle Discusses Potential White House Press Secretary Job in Interview","url":"http://www.breitbart.com/big-government/2017/05/16/kimberly-guilfoyle-discusses-potential-white-house-press-secretary-job-in-interview/","urlToImage":"http://media.breitbart.com/media/2016/07/Kimberly-Guilfoyle-Getty.jpg","score":25.458681,"fetchedAt":0},{"author":"Jessica Estepa","description":"Fox News host Kimberly Guilfoyle says she's in talks with the Trump administration about potentially becoming press secretary.","publishedAt":0,"title":"Fox News host: I'm talking to White House about press secretary job","url":"https://www.usatoday.com/story/news/politics/onpolitics/2017/05/16/fox-news-host-i-am-talking-to-white-house-about-press-secretary-job/101754346/","urlToImage":"https://www.gannett-cdn.com/-mm-/ec1c5d46c83f2eff3f4d421637da3ccc7e345d66/c=0-608-2421-1976&r=x633&c=1200x630/local/-/media/2017/05/16/USATODAY/USATODAY/636305445216133920-GTY-454891274-67068816.JPG","score":15.79001,"fetchedAt":0},{"author":"","description":"NEW YORK (AP) — Fox News host Kimberly Guilfoyle is in conversations with the Trump administration about replacing Sean Spicer as White House press secretary. The former first lady of San Francisco told the Mercury News in San Jose, California, on Monday that taking that job or having another press role in the White House has been \"raised by a number of people\" in the Trump administration. \"I'm a patriot, and it would be an honor to serve the country,\" Guilfoyle said. \"I think it'd be a fascinating job. It's a challenging job, and you need someone really determined and focused, a great communicator in there with deep knowledge to be able to handle that position.\"","publishedAt":0,"title":"Fox News' Guilfoyle up for White House press secretary job","url":"https://apnews.com/4785a245daa14877a4d7ee70631cd106","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:6670f020b8ab4ddc9ee2f665f093899e/2220.jpeg","score":8.165517,"fetchedAt":0}]