[{"author":"","description":"Nach Angaben von Bergsteigern ist der Hillary Step am Gipfel des Mount Everest abgebrochen. Das könnte künftige Aufstiege gefährlich machen, warnen Kenner des Berges.","publishedAt":0,"title":"Hillary Step: Mount Everest verliert markanten Felsabsatz","url":"http://www.zeit.de/entdecken/reisen/2017-05/hillary-step-mount-everest-zacken","urlToImage":"http://img.zeit.de/entdecken/reisen/2017-05/mount-everest-hillary-step/wide__1300x731","score":24.761324,"fetchedAt":0},{"author":"BINAJ GURUBACHARYA","description":"KATHMANDU, Nepal (AP) — The body of an Indian climber was spotted on Mount Everest on Monday, the fourth fatality on the mountain during a busy and tragic weekend on the world's highest peak. Sherpa rescuers spotted the body of Indian climber Ravi Kumar, but it was impossible to retrieve the body, said Thupden Sherpa of Arun Treks and Expedition. It appeared that Kumar had fallen some 200 meters (650 feet) below the route, he said. Climbers from the United States, Slovakia and Australia also died on the mountain over the weekend.","publishedAt":0,"title":"4 climbers die near top of Mount Everest in tragic weekend","url":"https://apnews.com/44c8352bba4949e4af8eca353dea49c4","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:3b457e7142d845a08543c2666f6a2e4d/3000.jpeg","score":18.542238,"fetchedAt":0},{"author":"","description":"A 27-year-old Indian climber, who went missing on Mount Everest, has died after he fell some 200 metres on his return after conquering the world's tallest peak, the fifth fatality on the mountain this season, an official said on Monday","publishedAt":0,"title":"Indian climber who went missing after conquering Mount Everest found dead - Times of India","url":"http://timesofindia.indiatimes.com/india/indian-who-went-missing-after-climbing-mount-everest-found-dead/articleshow/58790542.cms","urlToImage":"http://timesofindia.indiatimes.com/photo/msid-58791550/58791550.jpg?262786","score":18.400654,"fetchedAt":0},{"author":"Gopal Sharma","description":"An American climber on Mount Everest died on Sunday, officials said, the third death on the world's highest mountain in the past month and raising safety concerns for climbers.","publishedAt":0,"title":"American climber dies on Everest, Indian missing","url":"http://www.reuters.com/article/us-nepal-everest-idUSKBN18H0IT","urlToImage":"http://s3.reutersmedia.net/resources/r/?m=02&d=20170521&t=2&i=1185610557&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPED4K0FJ","score":12.726875,"fetchedAt":0},{"author":"Abdul Gani","description":"Anshu Jamsenpa of Bomdilla in Arunachal Pradesh became on Sunday the first woman to claim “dual ascent” of Mount Everest twice within a span of five days. She broke the previous record of Nepal’s Chhurim Sherpa, who had climbed Mt Everest twice in a week in 2012.","publishedAt":0,"title":"Mother of two from Arunachal becomes world's first woman to scale Everest twice in week - Times of India","url":"http://timesofindia.indiatimes.com/india/mother-of-two-from-arunachal-becomes-worlds-first-woman-to-scale-everest-twice-in-week/articleshow/58780844.cms","urlToImage":"http://timesofindia.indiatimes.com/photo/msid-58780839/58780839.jpg?91941","score":11.461109,"fetchedAt":0},{"author":"Chloe Farand","description":"A British mountaineer has confirmed a cliff face that is the last major obstacle on the main route to the summit of Mount Everest has collapsed, potentially making it even more dangerous for climbers to reach the world’s highest peak.  The Hillary Step, named after Sir Edmund Hillary, who made the first ascent with Tenzing Norgay in 1953, is believed to have collapsed during the devastating earthquakes that hit Nepal in 2015.","publishedAt":0,"title":"The last major obstacle on the way to the summit of Everest has collapsed","url":"http://www.independent.co.uk/news/world/asia/british-mountaineer-tim-mosedale-confirms-mount-everest-hillary-step-collapased-shock-horror-nepal-a7748311.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/12/07/13/climb.jpg","score":6.6804895,"fetchedAt":0}]