[{"author":"Bethan McKernan","description":"Israeli Prime Minister Benjamin Netanyahu has reportedly had to order his cabinet to meet visiting US President Donald Trump at a welcoming reception after several ministers refused to attend.","publishedAt":0,"title":"Israeli ministers refuse to meet Trump","url":"http://www.independent.co.uk/news/world/middle-east/benjamin-netanyahu-donald-trump-israel-visit-order-ministers-attend-ben-gurion-tel-aviv-airport-us-a7748716.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/02/05/15/benjamin-netanyahu-cabinet-1.jpg","score":10.587503,"fetchedAt":0},{"author":"Isabel Kershner","description":"Prime Minister Benjamin Netanyahu has met resistance within his cabinet over measures aimed at showing President Trump Israel’s willingness to resume peace talks with the Palestinians.","publishedAt":0,"title":"Preparations for Trump’s Visit Expose Political Rifts in Israel","url":"https://www.nytimes.com/2017/05/21/world/middleeast/trump-israel-visit.html","urlToImage":"https://static01.nyt.com/images/2017/05/22/world/22israel/22israel-facebookJumbo.jpg","score":10.587503,"fetchedAt":0},{"author":"Chris Cillizza, CNN Editor-at-large","description":"After an appearance alongside Israeli Prime Minister Benjamin Netanyahu Monday, President Donald Trump paused to push back against reports that he had disclosed highly classified information to the Russians.","publishedAt":0,"title":"Donald Trump denies a Russia allegation that no one made","url":"http://www.cnn.com/2017/05/22/politics/trump-israel-russia/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170522145403-09-trump-abroad-0522-super-tease.jpg","score":10.587503,"fetchedAt":0},{"author":"Carol E. Lee","description":"President Donald Trump met with Israeli Prime Minister Benjamin Netanyahu in an attempt to build on two days of talks in Saudi Arabia about a regional thaw between Arabs and Israelis.","publishedAt":0,"title":"Trump Meets With Israeli Leader in Bid to Revive Peace Process","url":"https://www.wsj.com/articles/trump-arrives-in-israel-in-bid-to-revive-peace-process-1495445977","urlToImage":"https://si.wsj.net/public/resources/images/BN-TN920_TRUMPI_TOP_20170522124135.jpg","score":10.587503,"fetchedAt":0},{"author":"Amir Tal and Oren Liebermann, CNN","description":"Israeli Prime Minister Benjamin Netanyahu has demanded his government ministers attend the arrival ceremony of US President Donald Trump on Monday morning after several of them said they were going to skip it, according to the office of one of the ministers.","publishedAt":0,"title":"Israel: Netanyahu says all government ministers must attend Trump's arrival","url":"http://www.cnn.com/2017/05/21/middleeast/israel-netanyahu-ministers-must-meet-trump/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170517151359-trump-netanyahu-handshake-super-tease.jpg","score":8.625725,"fetchedAt":0},{"author":"Spiegel Online","description":"Ereignisreicher Tag für Donald Trump in Jerusalem: Als erster amtierender US-Präsident besuchte er die Klagemauer, nun trifft er sich zum Gespräch mit Benjamin Netanyahu. Die wichtigsten Nachrichten zu seiner Israel-Reise im Newsblog.","publishedAt":0,"title":"+++ Newsblog +++: \"Ich habe das Wort 'Israel' nie erwähnt\"","url":"http://www.spiegel.de/politik/ausland/donald-trump-in-israel-newsblog-a-1148746.html","urlToImage":"http://cdn1.spiegel.de/images/image-1145284-galleryV9-dxks-1145284.jpg","score":8.625725,"fetchedAt":0},{"author":"Margaret Talev","description":"President Donald Trump, speaking in Israel alongside Prime Minister Benjamin Netanyahu, says he never mentioned Israel in talks with Russians. \"I never mentioned the word or the name Israel, never mentioned during that conversation. They’re all saying I did. So you have another story wrong. Never mentioned the word Israel\" Trump says \"tremendous progress\" made in Israel, Arab ties Netanyahu said intelligence sharing is \"terrific and it’s never been better\" Two leaders speak at the prime minister","publishedAt":0,"title":"Trump Says He Never Mentioned Israel in Talks With Russians","url":"https://www.bloomberg.com/politics/trackers/2017-05-22/trump-says-tremendous-progress-made-in-israel-arab-ties","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iOh3MaUEAbxU/v0/-1x-1.jpg","score":8.406861,"fetchedAt":0},{"author":"JONATHAN LEMIRE and JULIE PACE","description":"JERUSALEM (AP) — President Donald Trump on Monday defended himself against allegations he divulged classified information in a recent meeting with Russian diplomats, saying alongside Israeli Prime Minister Benjamin Netanyahu that he never identified Israel in his Oval Office conversation. At the end of his appearance with Netanyahu, Trump said that he \"never mentioned the word or the name Israel\" in his conversation with Russia's foreign minister and ambassador. \"So you have another story wrong,\" he said.","publishedAt":0,"title":"Trump says he didn't mention Israel in meeting with Russians","url":"https://apnews.com/6a1462f8dad542789e600afdfdf91e19","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:9de8d1bdf9e04f27a507e7badb7a9953/3000.jpeg","score":8.406861,"fetchedAt":0},{"author":"ILAN BEN ZION","description":"JERUSALEM (AP) — President Donald Trump got an abrupt Israeli welcome on his arrival in Tel Aviv on Monday, with ministers asking favors and snapping selfies as they sought to get a piece of the commander in chief's attention. Walking down the red carpet upon landing at Ben-Gurion International Airport, the president was greeted by dignitaries exhibiting the blunt forwardness and informality for which Israelis are known. Trump asked Israeli Prime Minister Benjamin Netanyahu what protocol was as they approached the dais before delivering their speeches. Netanyahu threw up his hands and replied: \"Who knows?\"","publishedAt":0,"title":"Trump greeted with selfies and politics on arrival in Israel","url":"https://apnews.com/e33ac101e2d14e5585fef468eda17a35","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:6f28dcd198f042b2b6b09c96ae7158ec/2170.jpeg","score":7.0539684,"fetchedAt":0}]