[{"author":"Karen DeYoung, Karen DeYoung","description":"The placement of the president’s visit is intended to affirm the administration’s view of the kingdom as the United States’ chief Arab and Muslim ally.","publishedAt":0,"title":"First stop on Trump’s first official trip overseas signals Saudi Arabia’s importance","url":"https://www.washingtonpost.com/world/national-security/first-stop-on-trumps-first-official-trip-overseas-signals-saudi-arabias-importance/2017/05/18/a70e9ba4-39c9-11e7-8854-21f359183e8c_story.html","urlToImage":"https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/05/18/Others/Images/2017-05-18/GettyImages-684507534.JPG","score":11.147339,"fetchedAt":0},{"author":"Melanie Eversley","description":"Singer Ariana Grande is OK after reports of multiple explosions at a concert Monday in Manchester in the United Kingdom","publishedAt":0,"title":"Explosions at Ariana Grande concert in U.K.","url":"https://www.usatoday.com/story/news/2017/05/22/reports-explosions-ariana-grande-concert-uk/102028686/","urlToImage":"https://www.gannett-cdn.com/-mm-/581841430c6ceab62aad91a49b47b140be4e887e/c=0-264-5184-3193&r=x1683&c=3200x1680/local/-/media/2017/05/22/USATODAY/USATODAY/636310777996536127-GTY-686936316.jpg","score":11.147339,"fetchedAt":0},{"author":"ADAM SCHRECK","description":"TEHRAN, Iran (AP) — Iran's newly re-elected President Hassan Rouhani on Monday called relations with the United States \"a curvy road,\" saying he hoped the Trump administration will \"settle down\" enough for his nation to better understand it. Rouhani also criticized Saudi Arabia after it just hosted President Donald Trump's first foreign trip, saying that the kingdom \"has never seen a ballot box\" while Iran just hosted a successful presidential election in which over 40 million people voted.","publishedAt":0,"title":"Iranian president calls US relations 'a curvy road'","url":"https://apnews.com/982502a07f0a4a0bbdee2cc3b8c36e44","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:32c1584aef734e858dee1f9ff2c30bb4/3000.jpeg","score":5.255124,"fetchedAt":0},{"author":"AYA BATRAWY","description":"DUBAI, United Arab Emirates (AP) — On his first overseas visit, President Donald Trump presided over a nearly $110 billion sale of military equipment to Saudi Arabia that made clear his administration did not see the kingdom's human rights record or its devastating war in Yemen as an obstacle to restoring ties that had been strained under his predecessor. The military agreement with Saudi Arabia, effective immediately, could expand up to $350 billion over 10 years. It appeared to reverse an Obama administration decision to pull back sales of precision-guided munitions to Saudi's armed forces over concerns sparked by a Saudi-led coalition bombing of a funeral hall in Yemen that killed more than 140 people.","publishedAt":0,"title":"Human rights concerns prove no obstacle in Trump-Saudi ties","url":"https://apnews.com/b180e554010942e19b62d8ccb2b05246","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:f38427f4ccac4f43a13040ad7f2e220e/3000.jpeg","score":3.3944483,"fetchedAt":0}]