[{"author":"Euan McKirdy, CNN","description":"Philippines President Rodrigo Duterte is soon to depart on an official visit Moscow as part of the Asian nation's pivot away from the United States","publishedAt":0,"title":"Philippines' Duterte looks to strengthen ties with trip to Moscow","url":"http://www.cnn.com/2017/05/22/asia/duterte-putin-moscow-summit/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170522130731-duterte-putin-lima-apec-super-tease.jpg","score":7.8845387,"fetchedAt":0},{"author":"By Julian Robinson","description":"WikiLeaks founder Julian Assange declared a victory for himself and the United Nations human rights system in his first public appearance since Sweden dropped a rape probe against him today.","publishedAt":0,"title":"Sweden drops its prosecution against WikiLeaks founder Julian Assange","url":"http://www.dailymail.co.uk/news/article-4521770/Sweden-drops-prosecution-against-Julian-Assange.html","urlToImage":"http://i.dailymail.co.uk/i/pix/2017/05/19/19/408BA11000000578-0-image-a-13_1495218910619.jpg","score":6.8092794,"fetchedAt":0},{"author":"Michelle Nichols","description":"North Korea's deputy United Nations envoy said on Friday \"it is ridiculous\" to link Pyongyang with the WannaCry \"ransomware\" cyber attack that started to sweep around the globe a week ago or the hacking of a U.N. expert monitoring sanctions violations.","publishedAt":0,"title":"North Korea says linking cyber attacks to Pyongyang is 'ridiculous'","url":"http://in.reuters.com/article/cyber-attack-northkorea-copy-idINKCN18G02T","urlToImage":"http://s4.reutersmedia.net/resources_v2/images/rcom-default.png","score":6.8092794,"fetchedAt":0},{"author":"Adelle Nazarian","description":"The national chair of the 9/11 Families & Survivors United for Justice Against Terrorism advocacy group wrote a letter to President Trump urging him not to buckle under pressure from Saudi Arabia.","publishedAt":0,"title":"EXCLUSIVE: Wife of 911 Victim Pens Letter to Donald Trump Urging Strength During Saudi Visit","url":"http://www.breitbart.com/big-government/2017/05/20/exclusive-wife-911-victim-pens-letter-trump-urging-strength-saudi-visit/","urlToImage":"http://media.breitbart.com/media/2017/05/trump-saudi-king-getty.jpg","score":6.8092794,"fetchedAt":0},{"author":"Mythili Sampathkumar","description":"Twenty million people around the world are starving to death and the United Nations said the world is only paying attention to the latest scandal of Donald Trump.  “If you turn on ABC, CBS, NBC, Fox, CNN — it’s nothing but Trump, Trump, Trump, Trump, Trump, Trump, Trump!,” said the director of the UN’s World Food Programme (WFP).","publishedAt":0,"title":"20 million people are starving and the media only cares about Trump, says UN","url":"http://www.independent.co.uk/news/world/americas/us-politics/trump-africa-famine-un-warning-millions-starving-media-coverage-a7745931.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/19/22/south-sudan-refugees.jpg","score":5.553275,"fetchedAt":0},{"author":"THE INTELLECTUALIST","description":"America divided – this concept increasingly graces political discourse in the U.S., pitting left against right, conservative thought against the liberal agenda. But for decades, Americans have been rearranging along another divide, one just as stark if not far more significant – a chasm once bridged by a flourishing middle class. Peter Temin, Professor Emeritus of Economics at MIT, believes the ongoing death of “middle America” has sparked the emergence of two countries within one, the hallmark of developing nations. In his new book, The Vanishing Middle Class: Prejudice and Power in a Dual Economy, Temin paints a bleak picture where one country has a bounty of resources and power, and the other toils day after day with minimal access to the long-coveted American dream. In his view, the United States is shifting toward an economic and political makeup more similar to developing nations than the wealthy, economically stable nation it has long been. Temin applied W. Arthur Lewis’s economic model – designed to understand the workings of developing countries – to the United States in an effort to document how inequality has grown in America. The parallels are unsettling. As noted by the Institute for New Economic Thinking: In...  Read more »","publishedAt":0,"title":"Study By MIT Economist: U.S. Has Regressed To A Third-World Nation For Most Of Its Citizens | The Intellectualist","url":"https://theintellectualist.co/study-mit-economist-u-s-regressed-third-world-nation-citizens/","urlToImage":"https://theintellectualist.co/wp-content/uploads/2017/04/18033943_302868900136563_4038026343794309181_n.jpg","score":4.193983,"fetchedAt":0},{"author":"NICK PERRY","description":"WELLINGTON, New Zealand (AP) — New Zealand has never had a space program but could soon be launching commercial rockets more often than the United States. That's if the plans of California-based company Rocket Lab work out. Founded by New Zealander Peter Beck, the company was last week given official approval to conduct three test launches from a remote peninsula in the South Pacific nation. Rocket Lab is planning the first launch of its Electron rocket sometime from Monday, depending on conditions.","publishedAt":0,"title":"New Zealand space launch has nation reaching for the stars","url":"https://apnews.com/624dba87449746ac9c15ff96d265cae6","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:d6be096044e6451fa9debf95d61f16dc/3000.jpeg","score":4.145582,"fetchedAt":0},{"author":"Rachael Revesz","description":"Ivanka Trump has praised the progress of women’s rights in Saudi Arabia after the country and the United Arab Emirates pledged to donate $100 million to the first World Bank's global project for women entrepreneurs. Speaking in Saudi Arabia as her father met with Arab and Islam leaders, Ms Trump said progress in the nation was “encouraging” but said there was “still a lot of work to be done”.","publishedAt":0,"title":"Ivanka Trump says Saudi Arabia's progress on women's rights is 'encouraging' - after it donates $100 million to her cause","url":"http://www.independent.co.uk/news/world/americas/ivanka-trump-world-bank-womens-entrepreneur-fund-saudi-arabia-united-arab-emirates-100-million-a7748501.html","urlToImage":"https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/21/15/ivanka-saudi-arabia-donald-trump.jpg","score":4.145582,"fetchedAt":0},{"author":"JOSH LEDERMAN","description":"ZAATARI REFUGEE CAMP, Jordan (AP) — His skull and jaw wrapped in bandages, the young Syrian refugee stared nonchalantly into a small black box at a supermarket in this sprawling, dust-swept refugee camp. The box scanned his iris to identify him, charged his account and sent him on his way. If the boy noticed U.S. Ambassador to the United Nations Nikki Haley watching intently from just a few feet away, he didn't show it. But Haley would later tout the iris-scanners as a fraud-cutting tool boosting efficiency for the more than $6.5 billion the U.S. has spent helping those whose lives have been upended by Syria's harrowing civil war.","publishedAt":0,"title":"At refugee camp, Trump envoy Haley vows more aid for Syrians","url":"https://apnews.com/f54fdacd13524729a3b8d358f9135db4","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:c999a1108e0b4997bda069ecfe69ba0c/3000.jpeg","score":2.6786113,"fetchedAt":0}]