[{"author":"Reuters Editorial","description":"The United States has evidence Syrian President Bashar al-Assad's government has built a crematorium at a large military prison outside the capital Damascus, a State Department official said on Monday.","publishedAt":0,"title":"U.S. says Syrians built crematorium at prison to dispose of bodies","url":"http://www.reuters.com/article/us-mideast-crisis-syria-usa-idUSKCN18B20E","urlToImage":"http://s3.reutersmedia.net/resources/r/?m=02&d=20170515&t=2&i=1184798075&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPED4E1NM","score":10.58527,"fetchedAt":0},{"author":"","description":"Russia says reports United States President Donald Trump revealed highly classified information about Islamic State to its Foreign Minister last week are fake.","publishedAt":0,"title":"Russia says reports Trump revealed classified information 'fake'","url":"http://www.abc.net.au/news/2017-05-16/reports-trump-revealed-secret-information-fake-russia/8531524","urlToImage":"http://www.abc.net.au/news/image/8531528-1x1-700x700.jpg","score":10.58527,"fetchedAt":0},{"author":"Ann Saphir","description":"Ramin Forouzandeh had applied to 13 PhD economics programs in the United States, but after President Donald Trump signed his first travel ban in January, the 25-year-old Iranian turned to Canada for other options.","publishedAt":0,"title":"Trump's travel bans spook some students, fan fears of broader chill","url":"http://www.reuters.com/article/us-usa-immigration-students-idUSKCN18C0BK","urlToImage":"http://s3.reutersmedia.net/resources/r/?m=02&d=20170516&t=2&i=1184942065&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPED4F0ZL","score":9.0509,"fetchedAt":0},{"author":"https://www.mediamatters.org/authors/eric-hananoki/2","description":"Callista Gingrich’s media production company sent sponsored emails claiming that “cancer was cured back in 1925” and such cures can be found in the Bible. Gingrich is reportedly set to become the United States’ ambassador to the Vatican.\r\n\r\nThe New York Times and CNN are reporting that President Donald Trump will soon nominate Gingrich","publishedAt":0,"title":"Likely Vatican Ambassador Callista Gingrich's Company Hawked Biblical Cancer \"Cure\"","url":"https://www.mediamatters.org/blog/2017/05/15/likely-vatican-ambassador-callista-gingrichs-company-hawked-biblical-cancer-cure/216451","urlToImage":"http://cloudfront.mediamatters.org/fads.today/static/uploader/image/2017/05/15/cgingrich.jpg","score":7.3735843,"fetchedAt":0},{"author":"NOMAAN MERCHANT","description":"BEIJING (AP) — When the sister of President Donald Trump's son-in-law Jared Kushner promoted investment in her family's new skyscraper from a Beijing hotel ballroom stage earlier this month, she was pitching a controversial American visa program that's proven irresistible to tens of thousands of Chinese. More than 100,000 Chinese have poured at least $24 billion in the last decade into \"golden visa\" programs across the world that offer residence in exchange for investment, an Associated Press analysis has found. Nowhere is Chinese demand greater than in the United States, which has taken in at least $7.7 billion and issued more than 40,000 visas to Chinese investors and their families in the past decade, the AP found.","publishedAt":0,"title":"AP Exclusive: Kushners tap China's $24B 'golden visa' market","url":"https://apnews.com/22a5d2a940024cffa47558d7b051368b","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:cb5eb622037e49619c0e0a276577de74/2890.jpeg","score":3.5480149,"fetchedAt":0}]
