[{"author":"Jim Michaels","description":"Marine Gen. Joseph Dunford, chair of the Joint Chiefs of Staff, says NATO should be prepared to deploy additional forces if President Trump and other leaders agree to bolster the Afghanistan mission.","publishedAt":0,"title":"NATO in Afghanistan: Marine Gen. Joseph Dunford says alliance should move quickly to deploy forces","url":"https://www.usatoday.com/story/news/world/2017/05/18/nato-afghanistan-marine-gen-joseph-dunford-says-alliance-should-move-quickly-deploy-forces/101820070/","urlToImage":"https://www.gannett-cdn.com/-mm-/59a99e6422cc025b26e80768bbd775de746a2e0f/c=0-42-2479-1443&r=x633&c=1200x630/local/-/media/2017/05/18/USATODAY/USATODAY/636306651906912701-AP-Belgium-NATO-Defense.jpg","score":11.732674,"fetchedAt":0},{"author":"","description":"After Afghanistan's spy agency allegedly \"detained and tortured\" two Pakistan embassy staffers, Islamabad - which India has accused of violating a 1961 convention of diplomatic relations in the Kulbhushan Jadhav case - accused Afghanistan of violating the Vienna Convention.","publishedAt":0,"title":"At receiving end after diplomats 'detained', Pakistan now accuses Kabul of violating Vienna Convention - Times of India","url":"http://timesofindia.indiatimes.com/world/pakistan/at-receiving-end-after-diplomats-detained-pakistan-now-accuses-kabul-of-violating-vienna-convention/articleshow/58729709.cms","urlToImage":"http://timesofindia.indiatimes.com/photo/msid-58730136/58730136.jpg?1266010","score":8.14615,"fetchedAt":0},{"author":"By Amie Gordon For Mailonline","description":"Councillor Jon Wright made the comments after Catherine Atkinson, from Ilkeston in Derbyshire, described herself as a barrister with a son and a husband who served as a soldier in Afghanistan.","publishedAt":0,"title":"Tory councillor says pregnant Labour candidate shouldn't be elected MP","url":"http://www.dailymail.co.uk/news/article-4518334/Councillor-says-pregnant-candidate-shouldn-t-elected-MP.html","urlToImage":"http://i.dailymail.co.uk/i/pix/2017/05/18/12/407BD5FE00000578-0-image-a-58_1495105973074.jpg","score":7.549789,"fetchedAt":0},{"author":"PETER ORSI and MARIA VERZA","description":"MEXICO CITY (AP) — A journalist is shot dead as she pulls out of her garage in the morning with her young son. Gunmen ambush another journalist while he lazes in a car wash hammock. An award-winning reporter is hauled out of his vehicle and gunned down a block from his office. On Monday, Javier Valdez became the sixth journalist slain in Mexico since early March, a deadly spree unusual even in a country that ranks behind only Syria and Afghanistan for such murders. There's no evidence directly linking the killings to each other, but collectively they are a grim signal that lawlessness and impunity continue to threaten the lives and work of journalists across much of the country.","publishedAt":0,"title":"Rash of media murders highlights deadly threats in Mexico","url":"https://apnews.com/3846384d46c042d58fbabf3a2091ae6c","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:a5ace16aff0744c8856c921ff33bae25/2597.jpeg","score":3.2450843,"fetchedAt":0}]