[{"author":"Charlie Spiering","description":"President Donald Trump and First Lady Melania Trump arrived in Saudi Arabia, personally greeted at the airport by King Salman.","publishedAt":0,"title":"Donald Trump Arrives In Saudi Arabia - Breitbart","url":"http://www.breitbart.com/big-government/2017/05/20/donald-trump-arrives-in-saudi-arabia/","urlToImage":"http://media.breitbart.com/media/2017/05/AP_17140261008234.jpg","score":15.170948,"fetchedAt":0},{"author":"Carol E. Lee","description":"President Donald Trump looked to bolster economic and security ties with Saudi Arabia by meeting with King Salman bin Abdulaziz Al Saud on the first day of his overseas trip.","publishedAt":0,"title":"Trump Aims to Strengthen Saudi Ties With Visit","url":"https://www.wsj.com/articles/president-donald-trump-arrives-in-saudi-arabia-as-overseas-trip-starts-1495263979","urlToImage":"https://si.wsj.net/public/resources/images/BN-TN516_34I1c_TOP_20170520031143.jpg","score":11.729623,"fetchedAt":0},{"author":"Jeremy Diamond and Zachary Cohen, CNN","description":"President Donald Trump signed a nearly $110 billion defense deal with Saudi Arabia's King Salman bin Abdulaziz Al Saud on Saturday, signaling the United States' renewed commitment to its alliance with the Gulf kingdom and desire to bolster its counterterrorism partnership.","publishedAt":0,"title":"Trump signs Kushner-negotiated $100B Saudi arms deal","url":"http://www.cnn.com/2017/05/19/politics/jared-kushner-saudi-arms-deal-lockheed-martin/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170518203934-01-jared-kushner-0518-super-tease.jpg","score":9.550778,"fetchedAt":0},{"author":"","description":"RIYADH, Saudi Arabia (AP) — The Latest on President Donald Trump's first trip abroad (all times local): 9:15 p.m. President Donald Trump briefly joined Saudi King Salman in a traditional male-only sword dance before a state dinner in his honor. Swaying side to side, the president stood shoulder to shoulder with Saudis for the traditional dance, which includes drumming and singing. The dance took place outside the King Abdulaziz Historical Center where First Lady Melania Trump, his son-in law Jared Kushner and daughter Ivanka will join Trump to dine with the Saudi king and other senior Saudi royals. The menu is to include an array of dishes, including steak and ketchup alongside the lamb and hefty portions of rice. He was greeted by the Saudi king and a long red carpet upon arrival to the capital, Riyadh, Saturday morning for his first overseas visit in office.","publishedAt":0,"title":"The Latest: Trump sways to the beat of Saudi sword dance","url":"https://apnews.com/760fedd92e5e438ca7dba0037b9e6ff2","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:07b8d98b00c24afd9c586400d73c8694/3000.jpeg","score":7.7364016,"fetchedAt":0}]