[{"author":"Charlie Spiering","description":"President Donald Trump and First Lady Melania Trump arrived in Saudi Arabia, personally greeted at the airport by King Salman.","publishedAt":0,"title":"Donald Trump Arrives In Saudi Arabia - Breitbart","url":"http://www.breitbart.com/big-government/2017/05/20/donald-trump-arrives-in-saudi-arabia/","urlToImage":"http://media.breitbart.com/media/2017/05/AP_17140261008234.jpg","score":18.326113,"fetchedAt":0},{"author":"Carol E. Lee","description":"President Donald Trump and King Salman of Saudi Arabia signed an estimated $110 billion of new arms deals on the first day of Mr. Trump’s first trip overseas since taking office.","publishedAt":0,"title":"Trump Signs $110 Billion in Arms Deals in Saudi Arabia as Foreign Trip Begins","url":"https://www.wsj.com/articles/president-donald-trump-arrives-in-saudi-arabia-as-overseas-trip-starts-1495263979","urlToImage":"https://si.wsj.net/public/resources/images/BN-TN516_34I1c_TOP_20170520031143.jpg","score":14.199244,"fetchedAt":0},{"author":"Justin Sink, Margaret Talev","description":"U.S. President Donald Trump held talks with Saudi Arabia’s King Salman in Riyadh on Saturday, the first stop on his inaugural foreign trip as he seeks to escape the controversy engulfing his administration.","publishedAt":0,"title":"Trump Talks With Saudi King Salman Amid Controversy at Home","url":"https://www.bloomberg.com/politics/articles/2017-05-20/trump-lands-in-saudi-arabia-with-white-house-engulfed-in-crisis","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iNY6tL_NHBRA/v0/1200x800.jpg","score":14.199244,"fetchedAt":0},{"author":"JULIE PACE and JONATHAN LEMIRE","description":"RIYADH, Saudi Arabia (AP) — President Donald Trump, in the first stop of his maiden trip abroad, received a regal welcome Saturday in Saudi Arabia, feted by the wealthy kingdom as he aims to forge strong alliances to combat terrorism while pushing past the multiple controversies threatening to engulf his young administration. Trump arrived in Riyadh after an overnight flight and was welcomed at elaborate airport ceremony punctuated by a military flyover and a handshake from Saudi King Salman. He is the only American president to make Saudi Arabia, or any majority Muslim country, his first stop overseas - a choice designed in part to show respect to the region after more than a year of Trump's harsh anti-Muslim campaign rhetoric.","publishedAt":0,"title":"Trump receives regal welcome in Saudi Arabia","url":"https://apnews.com/0f8266623c3548e1952525d93011bd56","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:9e6bc34df1254338b77007c390fea000/3000.jpeg","score":10.592405,"fetchedAt":0}]