[{"author":"Aileen Graef and Kate Bennett","description":"First lady Melania Trump and first daughter Ivanka Trump arrived in Riyadh, Saudi Arabia, Saturday morning sporting an absence of headscarves.","publishedAt":0,"title":"Melania and Ivanka Trump arrive in Saudi Arabia sans headscarves","url":"http://www.cnn.com/2017/05/20/politics/melania-ivanka-headscarves/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170520121048-16-trump-saudi-arabia-0520-melania-ivanka-super-tease.jpg","score":16.24445,"fetchedAt":0},{"author":"","description":"Melania and Ivanka Trump both arrived in Saudi Arabia on Saturday without their heads covered - two years after Donald Trump criticised Michelle Obama for doing the same thing.","publishedAt":0,"title":"Melania Trump arrives in Saudi Arabia without headscarf - two years after Donald criticised Michelle Obama for showing her hair","url":"http://www.telegraph.co.uk/news/2017/05/20/melania-trump-arrives-saudi-arabia-without-headscarf-two-years/","urlToImage":"http://www.telegraph.co.uk/content/dam/news/2017/05/20/TELEMMGLPICT000129283491-xlarge_trans_NvBQzQNjv4BqgZ8XJcuE7Nj96CuD2rvGvZSotz_VUoTnhlvELrXB1a8.jpeg","score":12.770372,"fetchedAt":0},{"author":"","description":"Riyadh, Saudi Arabia (AP) -- Accompanying her husband on his first international trip, U.S. first lady Melania Trump on Saturday stepped off of Air Force One conservatively dressed in long sleeves and pants to conform to the strict dress code that Saudi Arabia enforces for its female citizens. But one thing was missing from her black and gold-belted ensemble: a head scarf.","publishedAt":0,"title":"Melania Trump Skips Headscarf as She Arrives in Saudi Arabia","url":"https://www.bloomberg.com/news/articles/2017-05-20/melania-trump-skips-headscarf-in-saudi-arabia","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iS7ru7xIezSo/v0/1200x836.jpg","score":11.551828,"fetchedAt":0},{"author":"Charlie Spiering","description":"President Donald Trump and First Lady Melania Trump arrived in Saudi Arabia, personally greeted at the airport by King Salman.","publishedAt":0,"title":"Donald Trump Arrives In Saudi Arabia - Breitbart","url":"http://www.breitbart.com/big-government/2017/05/20/donald-trump-arrives-in-saudi-arabia/","urlToImage":"http://media.breitbart.com/media/2017/05/AP_17140261008234.jpg","score":9.819458,"fetchedAt":0},{"author":"Spiegel Online","description":"Ankunft in Riad: Seine erste Auslandsreise führt Donald Trump nach Saudi-Arabien, am Samstagmorgen deutscher Zeit stieg er dort mit First Lady Melania aus der Air Force One.","publishedAt":0,"title":"Riad-Besuch in Bildern: Donald Trump trifft König Salman","url":"http://www.spiegel.de/fotostrecke/donald-trump-in-saudi-arabien-der-besuch-in-der-bildern-fotostrecke-147674.html","urlToImage":"http://cdn1.spiegel.de/images/image-1144660-galleryV9-txim-1144660.jpg","score":6.940178,"fetchedAt":0},{"author":"","description":"RIYADH, Saudi Arabia (AP) — Ignoring President Donald Trump's past admonition, U.S. first lady Melania Trump did not cover her head Saturday when they arrived in Saudi Arabia on the opening leg of his first international tour since taking office. Two years ago, then-citizen Trump criticized then-first lady Michelle Obama's decision to go bare-headed on a January 2015 visit with her husband. \"Many people are saying it was wonderful that Mrs. Obama refused to wear a scarf in Saudi Arabia, but they were insulted. We have enuf enemies,\" Trump tweeted at the time, including a short-hand spelling for \"enough.\"","publishedAt":0,"title":"US first lady ignores Trump criticism and shuns headscarf","url":"https://apnews.com/b2ba6504a2364d96bc9edbf9cab063a6","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:bcbbf468b24f44eba6f05b8321c0bdba/3000.jpeg","score":4.913634,"fetchedAt":0},{"author":"","description":"RIYADH, Saudi Arabia (AP) — The Latest on President Donald Trump's first trip abroad (all times local): 9:15 p.m. President Donald Trump briefly joined Saudi King Salman in a traditional male-only sword dance before a state dinner in his honor. Swaying side to side, the president stood shoulder to shoulder with Saudis for the traditional dance, which includes drumming and singing. The dance took place outside the King Abdulaziz Historical Center where First Lady Melania Trump, his son-in law Jared Kushner and daughter Ivanka will join Trump to dine with the Saudi king and other senior Saudi royals. The menu is to include an array of dishes, including steak and ketchup alongside the lamb and hefty portions of rice. He was greeted by the Saudi king and a long red carpet upon arrival to the capital, Riyadh, Saturday morning for his first overseas visit in office.","publishedAt":0,"title":"The Latest: Trump sways to the beat of Saudi sword dance","url":"https://apnews.com/760fedd92e5e438ca7dba0037b9e6ff2","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:07b8d98b00c24afd9c586400d73c8694/3000.jpeg","score":4.0106664,"fetchedAt":0}]