[{"author":"JON GAMBRELL","description":"DUBAI, United Arab Emirates (AP) — Donald Trump Jr. traveled to Dubai and met a billionaire business partner in the city-state, discussing \"new ideas\" as the Emirati's real estate firm still lists possible plans for future joint projects while Trump's father is in the White House. The Trump Organization has said it won't make new foreign deals while Donald Trump serves as America's 45th president. That didn't affect the Trump International Golf Club in Dubai's opening in February , while a previously planned Trump-branded golf course designed by Tiger Woods is still being built nearby.","publishedAt":0,"title":"Donald Trump Jr., Dubai business partner discuss 'new ideas'","url":"https://apnews.com/62438c4821aa46fb8b0a6aa604a543ca","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:980119040eda4a7da9701ba69c4e9a73/3000.jpeg","score":7.204645,"fetchedAt":0},{"author":"AYA BATRAWY","description":"DUBAI, United Arab Emirates (AP) — Saudi Arabia is making every effort to dazzle and impress President Donald Trump on his first overseas trip, seizing on the visit to cement itself as a major player on the world stage and shove aside rival Iran. The kingdom has arranged a dizzying schedule of events for the two days Trump will be in town — inviting figures as varied as Sudanese President Omar al-Bashir, who has been indicted for war crimes by the International Criminal Court, Bret Baier, a host on the Fox News Channel that is popular with Trump and his supporters, and American country singer Toby Keith who is to perform for a male-only crowd in the Saudi capital, Riyadh.","publishedAt":0,"title":"Saudi Arabia working to dazzle Trump in busy overseas visit","url":"https://apnews.com/c602a848be074032a024e2a1e6f8926d","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:bd6c83ed628d4c56ad449477855efad1/3000.jpeg","score":7.204645,"fetchedAt":0},{"author":"AYA BATRAWY","description":"DUBAI, United Arab Emirates (AP) — First she's in the hands of her father, then she moves to her husband. Often, she ends up under the power of her son. From childhood through adulthood into old age, every Saudi woman passes from the control of one legal guardian to another, a male relative whose decisions or whims can determine the course of her life. Under Saudi law, the guardian's permission is required for a woman to get a passport, to travel abroad or to marry. It is also often demanded whenever a woman tries to do any number of things, including rent an apartment, buy a car, undergo a medical procedure or take a job. As a result, women are consigned to the legal status of minors.","publishedAt":0,"title":"Young or old, Saudi women live under male relatives' control","url":"https://apnews.com/bfda2be5460f4c8d8085746b6a9bec92","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:5116620975b44b91b48d0b973916ca21/2986.jpeg","score":5.654251,"fetchedAt":0},{"author":"JON GAMBRELL","description":"DUBAI, United Arab Emirates (AP) — Iranians vote Friday for the next president of the Islamic Republic, but how does that elected leader fit into the country's clerically managed government that approves candidates ultimately overseen by its supreme leader? THE SUPREME LEADER'S POWER At the heart of Iran's complex power-sharing government created after its 1979 Islamic Revolution is the supreme leader, a position now held by Ayatollah Ali Khamenei. The supreme leader also serves as the country's commander in chief over its military and the powerful Revolutionary Guard, a paramilitary force involved in the war in Syria and the battle against the Islamic State group militants in Iraq that also has vast economic holdings across Iran. An 88-member elected clerical panel called the Assembly of Experts appoints the supreme leader and can remove one as well, though that's never happened.","publishedAt":0,"title":"AP Explains: Voting, governance and clerical power in Iran","url":"https://apnews.com/539986cd08df4a88bdb21417c31df66f","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:ce643d38d1b44eec962dc10722fd0980/3000.jpeg","score":5.654251,"fetchedAt":0}]