[{"author":"Charlie Spiering","description":"President Donald Trump and First Lady Melania Trump arrived in Saudi Arabia, personally greeted at the airport by King Salman.","publishedAt":0,"title":"Donald Trump Arrives In Saudi Arabia - Breitbart","url":"http://www.breitbart.com/big-government/2017/05/20/donald-trump-arrives-in-saudi-arabia/","urlToImage":"http://media.breitbart.com/media/2017/05/AP_17140261008234.jpg","score":17.155409,"fetchedAt":0},{"author":"","description":"RIYADH, Saudi Arabia (AP) — The Latest on President Donald Trump's first trip abroad (all times local): 11:40 p.m. President Donald Trump is basking in a royal welcome in Saudi Arabia, a far cry from the contentious atmosphere he left behind in Washington. In the capital of Riyadh, Saudi King Salman greeted Trump warmly and later presented him with the kingdom's highest civilian honor, a gold medal, during a ceremony at the grand Saudi Royal Court. Trump rewarded his Saudi hosts with a $110 billion arms package aimed at bolstering Saudi security and a slew of business agreements. Trump spent most of his first day abroad shuttling between opulent palace ballrooms with the king. The two were overheard discussing natural resources and arms, and Salman bemoaned the destruction caused by Syria's civil war. Trump is on a five-stop swing that will take him to the Middle East and Europe.","publishedAt":0,"title":"The Latest: Trump presents Saudis with massive arms package","url":"https://apnews.com/760fedd92e5e438ca7dba0037b9e6ff2","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:07b8d98b00c24afd9c586400d73c8694/3000.jpeg","score":11.476304,"fetchedAt":0},{"author":"Jeremy Diamond and Zachary Cohen, CNN","description":"President Donald Trump signed a nearly $110 billion defense deal with Saudi Arabia's King Salman bin Abdulaziz Al Saud on Saturday, signaling the United States' renewed commitment to its alliance with the Gulf kingdom and desire to bolster its counterterrorism partnership.","publishedAt":0,"title":"Trump signs Kushner-negotiated $100B Saudi arms deal","url":"http://www.cnn.com/2017/05/19/politics/jared-kushner-saudi-arms-deal-lockheed-martin/index.html","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170518203934-01-jared-kushner-0518-super-tease.jpg","score":10.827139,"fetchedAt":0},{"author":"Margaret Talev, Jennifer Jacobs","description":"Donald Trump could hardly have scripted a more fitting close to his first day in Saudi Arabia: Rolling through the lobby of the National Museum in Riyadh in a luxury golf cart with his wife Melania and their host, King Salman, past a jumbo television screen showing American country singer Toby Keith’s concert in Riyadh.","publishedAt":0,"title":"Less Talk Is More on Trump's First Day in Saudi Arabia","url":"https://www.bloomberg.com/politics/articles/2017-05-21/postcard-from-riyadh-less-talk-is-more-on-trump-s-first-day","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ifBklonmh7t8/v0/1200x800.jpg","score":8.076918,"fetchedAt":0}]