[{"author":"Colin Dwyer","description":"An attempt to arrest a local militant group's leader went awry in Marawi City on Tuesday. By nightfall, militants occupied public buildings and the Philippine president cut his Russia trip short.","publishedAt":0,"title":"Duterte Declares Limited Martial Law As Bloodshed Breaks Out In Marawi City","url":"http://www.npr.org/sections/thetwo-way/2017/05/23/529703429/duterte-declares-limited-martial-law-as-bloodshed-breaks-out-in-marawi-city","urlToImage":"https://media.npr.org/assets/img/2017/05/23/ap_17142762675825_mini_wide-f38ffc988b308d8cf4398cd2baf207c563cae977.jpg?s=1400","score":14.927532,"fetchedAt":0},{"author":"","description":"As battles raged with ISIS-linked militants seizing buildings in Marawi City.","publishedAt":0,"title":"Duterte Declares Martial Law in South Philippines","url":"http://www.thedailybeast.com/duterte-declares-martial-law-in-south-philippines","urlToImage":"http://img.thedailybeast.com/image/upload/v1495605256/170523-philippines-siege-martial-law-cheat_ggknu5.jpg","score":9.035613,"fetchedAt":0},{"author":"Al Jazeera","description":"Emergency declaration follows heavy clashes between security forces and fighters in Mindanao's Marawi city.","publishedAt":0,"title":"Duterte declares martial law after Mindanao attack","url":"http://www.aljazeera.com/news/2017/05/duterte-declares-martial-law-mindanao-attack-170523171932275.html","urlToImage":"http://www.aljazeera.com/mritems/Images/2017/5/23/5f9a8690dbe6483caeeaab9a6303f49f_18.jpg","score":7.8131785,"fetchedAt":0},{"author":"Andreo Calonzo, Siegfrid Alegado","description":"Philippine President Rodrigo Duterte placed the southern island of Mindanao under military rule Tuesday night after terrorists linked to Islamic State clashed with government troops in Marawi, the most populous city in the island’s Muslim region.","publishedAt":0,"title":"Duterte Puts Mindanao Under Martial Law After Terrorist Clashes","url":"https://www.bloomberg.com/politics/articles/2017-05-23/duterte-declares-martial-law-in-mindanao-spokesman-abella-says","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ix5tBVQ0IZnk/v0/1200x675.jpg","score":6.045973,"fetchedAt":0},{"author":"JIM GOMEZ and TERESA CEROJANO","description":"MANILA, Philippines (AP) — Philippine President Rodrigo Duterte warned Wednesday that he'll be harsh in enforcing martial law in his country's south as he abruptly left Moscow to deal with a crisis at home sparked by a Muslim extremist siege on a city, where militants burned buildings overnight and are feared to have taken hostages. Duterte declared martial rule for 60 days in the entire southern Mindanao region, the restive third of the Philippine archipelago, Tuesday evening to try to crush Muslim extremists who have aligned themselves with the Islamic State group and occupied a hospital, jail and other buildings and battled troops in an audacious attack in Marawi City.","publishedAt":0,"title":"Duterte declares martial rule in besieged south Philippines","url":"https://apnews.com/a2d52f83b0a84117833f3f51729e7b96","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:d77f666f41d6469ab01ae093e07c9d75/3000.jpeg","score":3.019475,"fetchedAt":0},{"author":"JIM GOMEZ and TERESA CEROJANO","description":"MANILA, Philippines (AP) — Muslim extremists abducted a Catholic priest and more than a dozen churchgoers while laying siege to a southern Philippine city overnight, burning buildings, ambushing soldiers and hoisting flags of the Islamic State group, officials said Wednesday. President Rodrigo Duterte has declared martial law in the southern third of the nation and warned he would enforce it harshly. The violence erupted Tuesday night after the army raided the hideout of Isnilon Hapilon, an Abu Sayyaf commander who is on Washington's list of most-wanted terrorists with a reward of up to $5 million for his capture. The militants called for reinforcements from an allied group, the Maute, and some 50 gunmen managed to enter the city of Marawi.","publishedAt":0,"title":"Priest among 14 hostages taken in siege of Philippines city","url":"https://apnews.com/d7533b764de7457a872a0f3935cebb55","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:257fa563d72f442b8eb4abc18b3e7c65/3000.jpeg","score":2.3700705,"fetchedAt":0}]