[{"author":"BBC News","description":"Seven men will be in charge at the Vale of Glamorgan, causing concern for a political pressure group.","publishedAt":0,"title":"Council's all-male cabinet 'new low for diversity'","url":"http://www.bbc.co.uk/news/uk-wales-politics-40050714","urlToImage":"https://ichef.bbci.co.uk/news/1024/cpsprodpb/F3AD/production/_96218326_valeofglamorgan_cabinet2017.jpg","score":11.653926,"fetchedAt":0},{"author":"Josh Wingrove, Arne Delfs, Helene Fouquet","description":"Group of Seven chiefs are preparing to sign off on a substantially pared-down statement at the close of their meeting, an indication of persisting divisions on climate change and trade between Donald Trump and the six other leaders.","publishedAt":0,"title":"G-7 Leaders Agree to Disagree as Trump Cuts Goals Down to Size","url":"https://www.bloomberg.com/politics/articles/2017-05-26/g-7-leaders-agree-to-disagree-as-common-goals-cut-down-to-size","urlToImage":"https://assets.bwbx.io/s3/javelin/public/javelin/images/social-default-a4f15fa7ee.jpg","score":7.7825837,"fetchedAt":0},{"author":"Crispian Balmer and Noah Barkin","description":"Leaders of the Group of Seven wealthy nations meet African heads of state on Saturday, the final day of their annual summit which has been marked by discord over climate change, but unity on tackling terrorism.","publishedAt":0,"title":"G7 leaders turn gaze to Africa, climate harmony elusive","url":"http://www.reuters.com/article/us-g7-summit-idUSKBN18L2ZU","urlToImage":"//s4.reutersmedia.net/resources/r/?m=02&d=20170526&t=2&i=1186387545&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPED4P0PX","score":7.7825837,"fetchedAt":0},{"author":"Tim Ross","description":"Group of Seven leaders meeting in Sicily on Friday called on Google Inc., Facebook Inc. and other internet companies to do “substantially” more to take extremist material offline.","publishedAt":0,"title":"G-7 Says Google, Facebook Must Step Up Efforts Against Terror","url":"https://www.bloomberg.com/politics/articles/2017-05-26/g-7-says-google-facebook-must-step-up-efforts-against-terror","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iV4GKN9R8fHo/v0/1200x800.jpg","score":7.7825837,"fetchedAt":0},{"author":"The Associated Press","description":"Your daily look at late-breaking news, upcoming events and the stories that will be talked about today: 1. WHERE WORLD LEADERS ARE MEETING Leaders of the Group of Seven wealthy democracies are holding a summit in Sicily , where President Donald Trump is cast as a potential spoiler-in-chief.","publishedAt":0,"title":"10 Things to Know for Today","url":"https://apnews.com/49cd9beca1834ffe821bddf99b48e9c3","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:4b666e8dae1048bfa22bb0ca3235a994/3000.jpeg","score":6.335637,"fetchedAt":0},{"author":"COLLEEN BARRY, SYLVIE CORBET and DAVID McHUGH","description":"TAORMINA, Sicily (AP) — The differences are well-known: climate change, trade and migration threaten to throw a summit of the Group of Seven wealthy democracies off its consensus game, with U.S. President Donald Trump cast as the spoiler-in-chief. But it may not play out exactly that way, according to long-time G7 observers. \"It is a forum made for Donald Trump's particular style. It is highly informal, highly interactive and they speak in very colloquial language to each other,\" said John Kirton, director of the G7 Research Group at the University of Toronto. \"It is the ultimate lonely hearts club. No one understands how tough it is to have the top job except the peers with the top job in other countries.\"","publishedAt":0,"title":"Trump, G7 peers seek deals on terrorism, trade, climate","url":"https://apnews.com/687557cf74454dd7a65e65e1e44535aa","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:e8f437568612475b8a2ece286d5072c8/3000.jpeg","score":5.149458,"fetchedAt":0}]