[{"author":"","description":"On the last day of his first overseas trip, President Trump addressed US military personnel stationed at Naval Air Station Sigonella, in Sicily, Italy.","publishedAt":0,"title":"Trump on foreign trip: We hit a home run - CNN Video","url":"http://www.cnn.com/videos/politics/2017/05/27/trump-we-hit-a-home-run-on-foreign-trip-newsroom.cnn","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170527112206-trump-speaks-to-military-in-italy-super-tease.jpg","score":27.56587,"fetchedAt":0},{"author":"JONATHAN LEMIRE and JULIE PACE","description":"NAVAL AIR STATION SIGONELLA, Sicily (AP) — President Donald Trump on Saturday said his maiden trip abroad was a \"home run\" and he vowed to overcome the threat of terrorism, concluding a grueling five-stop sprint that ended with the promise of an imminent decision on the much-discussed Paris climate accord. Trump ended his nine-day trip with a speech to U.S. troops in Sicily, where he recounted his visits to Saudi Arabia, Israel, Belgium and Italy and his work to counter terrorism. The president said recent terrorist attacks in Manchester, England and Egypt underscored the need for the U.S. to \"defeat terrorism and protect civilization.\"","publishedAt":0,"title":"Trump calls first trip abroad 'home run' as challenges await","url":"https://apnews.com/ebbbdba4040e4da48adc11ee35a56325","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:f14651ec61494e9c939cd21f9ba96aba/2078.jpeg","score":10.911496,"fetchedAt":0},{"author":"","description":"NAVAL AIR STATION SIGONELLA, Italy (AP) — The Latest on President Donald Trump's first trip abroad (all times local): 11 p.m. President Donald Trump is opening the final leg of his maiden international trip, landing in Italy for meetings with the Group of 7 leaders. Trump and leaders from some of the world's wealthiest nations will hold wide-ranging talks on foreign affairs, including terrorism, trade and economic growth in Taormina, Italy. The White House is expects Trump to be pressed by many of the G-7 leaders to stay in the Paris climate accord. Trump has said he's waiting until after he returns to Washington to make a decision on whether to withdraw from the deal, which was agreed to by the Obama administration. The other G-7 leaders are Britain, Canada, France, Germany, Italy, and Japan. Trump flew to the Italian island of Sicily from Brussels, where he attended NATO meetings and met with European Union officials.","publishedAt":0,"title":"The Latest: Trump arrives in Italy for G-7 summit","url":"https://apnews.com/23a35ac5074f4b129ce6896f3c095063","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:669a52bef7314877bd2032e37789dc0e/2353.jpeg","score":8.566212,"fetchedAt":0},{"author":"","description":"NAVAL AIR STATION SIGONELLA, Sicily (AP) — The Latest on President Donald Trump's visit to Europe (all times local): 6:15 p.m. President Donald Trump says G-7 allies are pushing to end \"all trade-distorting practices.\" The president tweeted as he departed Sicily for Washington, concluding his nine-day maiden overseas trip. The president writes, \"Just left the #G7Summit. Had great meetings on everything, especially on trade where... \"we push for the removal of all trade-distorting practices....to foster a truly level playing field.\" Trump discussed trade with the leaders of Italy, Britain, France, Germany, Canada and Japan during the summit, but it was not immediately clear what he meant by the tweet. Trump has advocated for fair trade, not free trade.","publishedAt":0,"title":"The Latest: From the air, Trump tweets about trade","url":"https://apnews.com/ce8e9cf85b214fab8d872107f5ba9217","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:a2dd0479a1fb4de9b2f5df599fe469e0/3000.jpeg","score":8.566212,"fetchedAt":0}]