[{"author":"Eliza Relman","description":"Hillary Clinton gave the commencement address at Wellesley College on Friday afternoon, delivering an extended and blistering attack on President Donald Trump.","publishedAt":0,"title":"Hillary Clinton used her college commencement speech to extensively troll Trump","url":"http://www.businessinsider.com/hillary-clinton-wellesley-commencement-speech-trump-2017-5","urlToImage":"http://static2.businessinsider.com/image/59285da5b74af41b008b49ea-1190-625/hillary-clinton-used-her-college-commencement-speech-to-extensively-troll-trump.jpg","score":15.078333,"fetchedAt":0},{"author":"Sam Speedy","description":"Hillary Clinton shades Trump, evoking the Nixon impeachment during her Wellesley College commencement speech.","publishedAt":0,"title":"Did you catch all of Hillary Clinton's commencement speech shade?","url":"http://mashable.com/2017/05/26/hillary-clinton-wellesley-commencement-shade-trump/","urlToImage":"http://i.amz.mshcdn.com/cE9yrfu5ih41bkzFSeZJlv13BiI=/1200x630/2017%2F05%2F26%2Fd6%2F84f61306590e4d4f8f2de71a1c29901d.9ce6c.png","score":15.078333,"fetchedAt":0},{"author":"https://www.facebook.com/NolanDMcCaskill","description":"Clinton returned to Wellesley College on Friday as an alumna of the institution where in 1969 she became the first student commencement speaker.","publishedAt":0,"title":"Clinton launches new campaign against Trump","url":"http://www.politico.com/story/2017/05/26/hillary-clinton-wellesley-college-commencement-2017-238863","urlToImage":"http://v.politico.com/images/1155968404/201705/3491/1155968404_5449867643001_5449848206001-vs.jpg?pubId=1155968404","score":15.078333,"fetchedAt":0},{"author":"","description":"Hillary Clinton reflected on her 2016 election loss during a commencement speech at her alma mater Wellesley College, saying long walks in the woods and chardonnay helped her cope.","publishedAt":0,"title":"Clinton on election loss: Chardonnay helped - CNN Video","url":"http://www.cnn.com/videos/us/2017/05/26/hillary-clinton-commencement-speech-chardonnay-helped-sot.cnn","urlToImage":"http://i2.cdn.cnn.com/cnnnext/dam/assets/170526122257-hillary-clinton-commencement-5-26-super-tease.jpg","score":11.673533,"fetchedAt":0},{"author":"STEVE LeBLANC","description":"WELLESLEY, Mass. (AP) — Hillary Clinton peppered her Wellesley College commencement address Friday with barbs aimed at her rival in last year's presidential election, criticizing President Donald Trump's budget proposal as a mean-spirited \"con.\" The former Democratic presidential nominee never mentioned Trump by name even as she lashed out at his proposed budget as \"an attack of unimaginable cruelty on the most vulnerable among us.\" She said during her speech at her alma mater that the spending proposal fails to address critical issues such as opioid addiction and climate change. \"It is shrouded in a trillion-dollar mathematical lie,\" she said. \"Let's call it what it is. It's a con. They don't even try to hide it.\"","publishedAt":0,"title":"Clinton calls Trump's budget a mean-spirited 'con'","url":"https://apnews.com/9efb650d6c4b49759d185b9d797e0159","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:2c2e35cb9f4d4420bacbe62d8876deb3/3000.jpeg","score":6.4982557,"fetchedAt":0},{"author":"JOCELYN NOVECK","description":"Forty-eight years after she gave her first commencement address at Wellesley College, Hillary Clinton returns on Friday to offer another — and once again, she's at a crossroads in her life. The first time, she was 21 years old and eager to take on life's adventures, a graduating senior whose bold speech delighted her classmates, dismayed the school's president, and made it into Life magazine. The Hillary who will speak this year on Severance Green Lawn is the battle-scarred politician who came agonizingly close to becoming the first female president of the United States.","publishedAt":0,"title":"As Clinton emerges from the woods, what will her role be?","url":"https://apnews.com/edca73ae815a461eb00bdba80e6c37e3","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:c4add0ac875442e0826146b0d6b033f3/3000.jpeg","score":5.834835,"fetchedAt":0}]