[{"author":"The Associated Press","description":"The medical examiner's office said Chris Cornell, 52, hanged himself in Detroit. A full autopsy and results of toxicology tests are pending.","publishedAt":0,"title":"Chris Cornell's funeral will be Friday in L.A.","url":"https://www.usatoday.com/story/life/music/2017/05/21/chris-cornell-funeral-will-be-friday-in-la/101998352/","urlToImage":"https://www.gannett-cdn.com/-mm-/2083d24785e6bcbb0afa51cfe2cd508fc9916bcb/c=0-247-3000-1942&r=x633&c=1200x630/local/-/media/2017/05/18/USATODAY/USATODAY/636306961301931060-124719357-90982624.JPG","score":24.652096,"fetchedAt":0},{"author":"","description":"NEW YORK (AP) — Soundgarden frontman Chris Cornell will be buried Friday in Los Angeles, his attorney Kirk Pasich said Sunday. Pasich said Cornell will be buried at Hollywood Forever Cemetery in a private service. Cornell's body was transported to Los Angeles on Sunday.","publishedAt":0,"title":"Soundgarden frontman Cornell's funeral will be Friday in LA","url":"https://apnews.com/c0c62e81ffa349479250f0541f1fb083","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:363d24bdab644ebca41aae2aa2c0919d/3000.jpeg","score":11.121127,"fetchedAt":0},{"author":"Matt Giles","description":"Fronted by Eddie Vedder and Chris Cornell, Temple of the Dog was the original rock supergroup. Their music video “Hunger Strike” helped launch a musical movement.","publishedAt":0,"title":"How Temple of the Dog Pioneered a New Genre of Music Videos in the ’90s","url":"https://longreads.com/2017/05/09/temple-dog-90s-music-videos/","urlToImage":"https://longreadsblog.files.wordpress.com/2017/05/20170502-temple-of-the-dog.jpg?w=1200","score":10.924339,"fetchedAt":0},{"author":"","description":"Am Mittwoch ist Chris Cornell tot in seinem Hotel in Detroit gefunden worden. Die Polizei geht jetzt davon aus, dass der Sänger von Soundgarden durch Suizid starb.","publishedAt":0,"title":"Trauert nicht um mich","url":"http://www.tagesspiegel.de/kultur/details-zum-tod-von-chris-cornell-trauert-nicht-um-mich/19833300.html","urlToImage":"http://www.tagesspiegel.de/images/july-11-2015-kitchener-ontario-canada-american-rock-band-soundgarden-performed-at-big-music-f/19833424/1-format530.jpg","score":9.43275,"fetchedAt":0},{"author":"The Associated Press","description":"The Latest on the 2017 Billboard Music Awards at the T-Mobile Arena in Las Vegas (all times local): 7:30 p.m. A moment of silence was observed during the 2017 Billboard Music Awards on Sunday for Soundgarden frontman Chris Cornell who was found dead Thursday in his hotel room in Detroit. Dan Reynolds of Imagine Dragons said in the tribute that Cornell, who also sang lead in the band Audioslave, was a singer who had \"a voice for the ages.\" A leader of the grunge movement spreading out of Seattle, the 52-year-old will be buried Friday in Los Angeles.","publishedAt":0,"title":"The Latest: Billboards hold moment of silence for Cornell","url":"https://apnews.com/b5db3ddce7944af4a7fca6a0bbe503c0","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:5343cecd03fb47429e0d5747d700bc94/3000.jpeg","score":6.389903,"fetchedAt":0},{"author":"","description":"(AP) -- Drake was a high roller in Las Vegas, beating Adele's record for most wins at the Billboard Music Awards. Cher and Celine Dion each reflected on their own iconic careers and amazing songs on Sunday night's awards show, while a moment of silence was held for rocker Chris Cornell, who died Thursday in Detroit. Miley Cyrus delivered an emotional, but low-key performance and Vanessa Hudgens shined as co-host.","publishedAt":0,"title":"Drake Dominates, Cher Reflects At Billboard Music Awards","url":"https://www.bloomberg.com/news/articles/2017-05-22/drake-dominates-cher-reflects-at-billboard-music-awards","urlToImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iGYbP..GwtVQ/v0/1200x854.jpg","score":5.7401094,"fetchedAt":0},{"author":"KRISTIN M. HALL","description":"Drake was a high roller in Las Vegas, beating Adele's record for most wins at the Billboard Music Awards. Cher and Celine Dion each reflected on their own iconic careers and amazing songs on Sunday night's awards show, while a moment of silence was held for rocker Chris Cornell, who died Thursday in Detroit. Miley Cyrus delivered an emotional, but low-key performance and Vanessa Hudgens shined as co-host. These are the top moments from the awards show. ___ DRAKE'S LUCKY 13","publishedAt":0,"title":"Drake dominates, Cher reflects at Billboard Music Awards","url":"https://apnews.com/5bc678a3187d4dd389b09c92fbfdbc2d","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:e900b2445bee40e9b171b7231facaf6c/2831.jpeg","score":5.7401094,"fetchedAt":0}]