[{"author":"Jacob Pramuk","description":"Office of Management and Budget director Mick Mulvaney holds a briefing at the White House on Tuesday.","publishedAt":0,"title":"Watch: White House briefing with OMB director Mulvaney","url":"http://www.cnbc.com/2017/05/23/watch-white-house-briefing-with-omb-director-mulvaney.html","urlToImage":"https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2017/05/01/104440115-GettyImages-654170364.1910x1000.jpg","score":15.920896,"fetchedAt":0},{"author":"Bob Bryan","description":"\"The spending on the border security is $2.6 billion, of which I think $1.6 billion is actual bricks and mortar construction,\" OMB direcotr Mick Mulvaney said.","publishedAt":0,"title":"Trump's budget lays out $1.6 billion for construction of the wall along the US-Mexico border","url":"http://www.businessinsider.com/trump-white-house-2018-budget-funding-for-mexico-border-wall-2017-5","urlToImage":"http://static1.businessinsider.com/image/5923ad0863914721008b5ab2-1190-625/trumps-budget-lays-out-16-billion-for-construction-of-the-wall-along-the-us-mexico-border.jpg","score":14.280831,"fetchedAt":0},{"author":"JOSH BOAK","description":"WASHINGTON (AP) — Trump budget director Mick Mulvaney, defending an administration that promises more economic growth than many think it can deliver, said Tuesday it's the Obama administration that went overboard in its forecasts for growth. His indictment glosses over significant differences in the economy now and then. A look at his statement on the subject:","publishedAt":0,"title":"AP FACT CHECK: Budget chief slams Obama growth forecast","url":"https://apnews.com/1a65541bcecb4e0c8641b2fbdb51d107","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:d860279456b64cdb9158bfca39b8680e/3000.jpeg","score":10.043187,"fetchedAt":0},{"author":"JOSH BOAK","description":"WASHINGTON (AP) — The Trump administration's budget plan for 2018 assumes that a mix of sharp spending and tax cuts can both shrink the deficit and fuel economic growth of 3 percent a year — a level it hasn't achieved in more than a dozen years. Most economists and budget experts dismiss that promise as fancifully unrealistic. They say there are multiple flaws with the numbers unveiled by President Donald Trump's budget director, Mick Mulvaney. They range from improbable growth projections that appear to disregard an aging population to proposed cuts to education, research and social programs that have helped sustain the productivity of U.S. workers.","publishedAt":0,"title":"Why Trump's budget plan wouldn't likely accelerate growth","url":"https://apnews.com/4f62d156e2b249fc8b694485439f7ed7","urlToImage":"https://storage.googleapis.com/afs-prod/media/media:482c28eb03bc40f8987e787109b17a1a/3000.jpeg","score":6.159329,"fetchedAt":0}]